const characterIntro = {
	//众星之魂
	"xjzh_zxzh_linlingshiyu":"技能设计：吃朵棉花糖<br><br>技能编译：吃朵棉花糖<br><br>配音CV：挂娘、指尖旋律<br><br>角色故事：暂无",
	"xjzh_zxzh_yuanyuan":"林子言的妻子，同为散修拜入剑宗，林子言对其颇为照顾，且异常关心，后结为夫妻。",
	"xjzh_zxzh_mufeng":"",
	"xjzh_zxzh_moqinwu":"",
	"xjzh_zxzh_linziyan":"",
	"xjzh_zxzh_moqinyan":"",
	"xjzh_zxzh_yumuren":"",
	"xjzh_zxzh_linmo":"",
	"xjzh_zxzh_jiangningzhi":"",

	//流放之路
	"xjzh_poe_nvwu":"",
	"xjzh_poe_yuansushi":"",
	"xjzh_poe_juedouzhe":"",
	"xjzh_poe_chuxing":"",
	"xjzh_poe_weishi":"",
	"xjzh_poe_youxia":"",
	"xjzh_poe_ruiyan":"",
	"xjzh_poe_guizu":"",

	//王者荣耀
	"xjzh_wzry_libai":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;巍峨的长安城，数百年间屹立不倒。但长安的门户，守卫严密的朱雀门却镌刻着一道剑痕，那是一个青年醉后以长剑所书的诗句“欲上青天揽明月”，轰动整个长安城。当治安官狄仁杰欲以破坏长安的罪名逮捕他时，爱才的女帝拒绝了。女帝甚至下令保留朱雀门上饱含剑意的诗痕。数日之间，这名一人一剑，直入长安的青年“剑仙”之名传遍长安。他就是李白。<br>&ensp;&ensp;&ensp;&ensp;彼时的李白，年少轻狂，拒绝了女帝入朝为官的邀请后，开始试剑天下的旅途。当他初次见到滔滔黄河时，心中的剑意迸发而出，奔流到海不复回。从那时起，没有机关的师承，没有魔道的秘法，没有魔种的血脉的李白，仅仅依靠自己和手中的剑，成为帝国强者中的第一人，乃真正的天纵之才。他会给每个败于己的对手赋诗，因此，诗名和剑名也一同流传开来。后来，甚至有人视之为荣耀，为得诗篇而求一败，令人哭笑不得。<br>&ensp;&ensp;&ensp;&ensp;就在李白的剑意到达巅峰之后不久，旅途也来到了云中漠地。很少有人知道，生活在长安的李白，出生于云中漠地的海市蜃楼之下。他怀着剑仙荣耀归来，却发现幼年记忆里充满异域风情的繁华城池已经不复存在。被贩为奴隶的公主，向他倾诉自己的遭遇：帝国的铁骑越过长城，踏平了整个云中漠地。荒废的城池很快被黄沙掩埋。李白想要救出她，少女却选择了从屈辱中自我了断。<br>&ensp;&ensp;&ensp;&ensp;鲜血激起了李白的侠义之心。他第二次单剑闯入长安，质问女帝讨要征平云中漠地的说法。一夜长安风云变色，大明宫也在剑仙之剑下黯然无光。有史以来从未曾被外力攻破的长安城，第一次因为一个普通人而动摇。<br>&ensp;&ensp;&ensp;&ensp;没有人知道最后发生了什么事。李白自长安城中全身而退。他和女帝的密谈，被视为禁忌，不见于史官的笔下。<br>&ensp;&ensp;&ensp;&ensp;只有李白自己清楚，他的骄傲被挫败了，在最强的巅峰。从那之后，他开始自我放逐，从寂寞的旅途中寻求新的意义，陪伴他的，除了剑，还多了酒。<br>&ensp;&ensp;&ensp;&ensp;人人都以为剑仙就此一蹶不振。但长安的府衙中，狄仁杰查看着关于李白的行踪报告，露出难以捉摸的冷笑。<br>&ensp;&ensp;&ensp;&ensp;“元芳，你怎么看？”<br>&ensp;&ensp;&ensp;&ensp;不等密探回答，他立刻自言自语：“再次出鞘的时候，会更加惊天动地吧。这家伙，太过骄傲，又太过寂寞了。”<br>&ensp;&ensp;&ensp;&ensp;而狄仁杰所预言的这一天，在数年之后到来。<br>&ensp;&ensp;&ensp;&ensp;这是长安城平常的一天。晨钟回响在上空，自云中漠地的旅人远途而来，正抬首打量朱雀门上的剑痕；热闹的长乐坊中，五陵少年们因前所未有的美妙琴声而骚动；感业寺的银杏树依旧枝繁叶茂。唯有狄仁杰手下的密探隐入黑暗，紧张注视着那个白衣潇洒，酒剑相伴的男子身影。<br>&ensp;&ensp;&ensp;&ensp;剑仙李白，三入长安了。<br>&ensp;&ensp;&ensp;&ensp;这次长安城又将怎样被动摇呢？<br>&ensp;&ensp;&ensp;&ensp;“大河之剑天上来！”",
	"xjzh_wzry_yao":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;曜是一个从小怀抱英雄梦想的热血少年，与冷静强大的姐姐镜激烈的争夺着所有比赛的第一。尽管天性不同，但他们都到了稷下学习，渴望在这座象征着王者大陆最高智慧的学府中获得成长。<br>&ensp;&ensp;&ensp;&ensp;曜在老师庄周举办的归虚梦演报名中结识到朋友并成为这支“星之队”的队长，他们的心灵突破了种种桎梏、在竞赛角逐中相继绽放异彩，曜通过环中梦竞赛一节寻找到自我意识的根基，掌握到星辰之力，用剑划下了有力的一笔，就像淹没于漫天星辰中的星星，终于闪烁出独属他的光芒。<br>&ensp;&ensp;&ensp;&ensp;少年曜在环中梦里打败了姐姐，然而作为英雄，一切才刚刚开始。",
	"xjzh_wzry_ganjiangmoye":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;大河之畔生活着贫寒的工匠夫妇。两人青梅竹马，相依为命。丈夫干将别无所长，只是一味痴迷于铸剑。废弃掉的剑在门外堆成了剑冢。村人都嘲笑这个不通世事的家伙，唯有妻子无怨无悔支持着他。<br>&ensp;&ensp;&ensp;&ensp;干将内心同样愧疚于妻子不能过上更好的生活。他只懂得铸剑，便希望能借此扬名，那样终究会有令妻子自豪和荣耀的一天。于是他带着作品去拜访各地的铸剑师，并挑战他们。他削断无数名匠之作，很快让自己的名字传遍云梦泽。自然，被砸掉招牌的铸剑师们也对他恨之入骨。<br>&ensp;&ensp;&ensp;&ensp;世间公认有位绝代的大师。人们都说他的铸剑不仅削铁如泥，而且栖息着魂灵。大师许多弟子都败于干将之手，他们联合起来向师傅痛诉。于是大师向干将送上邀请拜访的帖子。<br>&ensp;&ensp;&ensp;&ensp;胜过大师，自己就是名副其实的当世铸剑第一人。可他如约登门时，大师甚至没有露面，只命弟子持剑在门口迎接，轻轻一挥就将干将之剑斩成几半。匠人们出了一口恶气！他们放声嘲笑干将，把过往的耻辱加倍回报给他。<br>&ensp;&ensp;&ensp;&ensp;干将落荒而逃，失败在心中灼烧。他回到家中重复起枯燥的铸造生涯。熔炉四时不熄，每把剑都比前一把更加锋利，可它们始终是没有生命的铁片。死的剑和活的剑，犹如天上地下般的差距。他逐渐执念于铸剑，完全忘掉了初衷，连妻子的身体日渐衰弱都没有注意到。<br>&ensp;&ensp;&ensp;&ensp;铸剑疯子的事传到阴阳家们耳中。自称为东皇太一的男人召见铸剑师，领他登上祭祀之地，那里矗立着一把剑。干将立刻认出这是大师的作品。<br>&ensp;&ensp;&ensp;&ensp;“这把剑守护着太古的奇迹。它的名字叫巨阙，里面栖息着魂灵：它是剑——更是盾牌。接近它的人都会被剑锋撕裂。”东皇太一的计划困难而有效：锻造更锋利的剑，斩断它。<br>&ensp;&ensp;&ensp;&ensp;“帮我得到奇迹，你就可达成心愿，成为世间无可逾越的铸剑师。在此之前，让我先告诉你让剑活过来的秘法吧。”<br>&ensp;&ensp;&ensp;&ensp;干将浑身颤栗着，不敢相信耳中所闻。<br>&ensp;&ensp;&ensp;&ensp;东皇太一交给他<br>&ensp;&ensp;&ensp;&ensp;太古保存下来的精铁。炉火燃烧了三天三夜，精铁无论如何都不能融化。干将眼里布满血丝，内心天人交战，需要一个生命才能让剑活过来。<br>&ensp;&ensp;&ensp;&ensp;他太专注，没有注意到妻子悄无声息接近，眼神温柔而忧伤。她收到匿名来信，信上写着实现丈夫心愿的方法。自己的身体早已病入膏肓，命中注定要拿去成全爱人。干将从火炉的阴影中抬起头，正好迎上妻子最后的笑容——下一刻她便猛然跳入炉火中。<br>&ensp;&ensp;&ensp;&ensp;撕心裂肺的呼唤和陡然明亮的铁水席卷内心，另一手下意识握紧了铁锤。痛苦转瞬即逝，成功的狂热反倒熔炼了太古的精铁。天明时分，迄今最杰出的作品诞生了，里面栖息着魂灵。男人怀抱宝剑，呢喃着妻子的名字：莫邪。嘴角微微上翘：最爱的妻子和剑，如今是一体了。<br>&ensp;&ensp;&ensp;&ensp;正如东皇太一计划的那样，莫邪剑斩断了巨阙，奇迹“转生之术”的力量被解放出来。这是太古建造的最后奇迹。<br>&ensp;&ensp;&ensp;&ensp;付出那么多，终于可以凌驾世间所有铸剑者之上了！干将毫不犹豫扑向光辉中。炉火般的灼热力量包裹着他，魔道千锤百炼着血肉之躯，令其坚硬而锋利。<br>&ensp;&ensp;&ensp;&ensp;他实现至高的愿望，将自己也锻造为剑。<br>&ensp;&ensp;&ensp;&ensp;故事并未到此结束。干将付出全部所有，现在他需要证明自己。于是他重访大师住所，去回报过往的羞辱。可全部执念面对冷冰冰的墓石却戛然而止：大师早已逝去多年。支撑人生的信念顿时崩塌，统统化作疯狂和绝望。怀抱中的莫邪剑变幻为妻子的身影，轻声安慰他。只有她，永远只有她善解人意，与自己不离不弃。<br>&ensp;&ensp;&ensp;&ensp;一分为二的生命，独一无二的魂灵。",
	"xjzh_wzry_haiyue":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;<br><br>&ensp;&ensp;&ensp;&ensp;海月是最古老的月裔之一，也是神秘莫测的云中蝶的饲养人。<br><br>&ensp;&ensp;&ensp;&ensp;她在孩童时期曾因孱弱多病而被视为无用之人，被村子遗弃在野外苟延残喘十余年。最终在一场饥荒之年的冬夜，她平静地接受了自己将被野兽当作食物的命运。但是，帝俊的降临让云中度过了灾厄，也将她从死亡边缘拉了回来。<br><br>&ensp;&ensp;&ensp;&ensp;从那以后，她立誓将自己的生命献给神。为此，她经历了残酷的人体改造，成为了由帝俊亲手制造的神职者“月裔”中的一员。她忠心耿耿地追随并协助帝俊在云中的所有计划，她亲眼见证帝俊的光辉结束了人间的永夜，和众人一起拥戴祂为“神明”。然而，一场天地倒卷的诸神之战将这些都毁灭了。在圣剑弑神的瞬间，海月透支自己的生命，借用帝俊赐予她的“云中蝶”爆发出了惊人的力量，让众神的军队陷入了一瞬的幻境。正是这短暂的片刻让帝俊的神魂得以逃逸。<br><br>&ensp;&ensp;&ensp;&ensp;一千多年过去了，众神的传说早已湮灭于虚空，但在遥远的漠北天阙山巅，一缕执念却始终萦绕在海月那具早已死亡的琉璃躯体上。“不能让祂这样死去”，成为了铭刻在海月灵魂深处的印记，留在了人间。直到有一天，漠南来的少年不小心打破了天阙山的宁静，也惊醒了沉睡中的幽魂。经历了千年的死别，醒来的海月发誓定要夺回神明的遗产，迎接祂的归来。<br><br>&ensp;&ensp;&ensp;&ensp;为此，她将不惜一切代价。",
	"xjzh_wzry_huamulan":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;静如影，疾如风。<br><br>&ensp;&ensp;&ensp;&ensp;金属的撞击声中，身影掠过。<br><br>&ensp;&ensp;&ensp;&ensp;不动如山，迅烈如火。<br><br>&ensp;&ensp;&ensp;&ensp;偷袭者重重跌倒在地。<br><br>&ensp;&ensp;&ensp;&ensp;战士的头盔裂开，被她扔到地上。发丝飘散出来。<br><br>&ensp;&ensp;&ensp;&ensp;女人！<br><br>&ensp;&ensp;&ensp;&ensp;“想活命吗？紧跟着我！”<br><br>&ensp;&ensp;&ensp;&ensp;前方是无际的长城，以及无际的敌人。<br><br>&ensp;&ensp;&ensp;&ensp;“姐可是传说！”",
	"xjzh_wzry_duoliya":"注：本故事纯属虚构，与真实历史无关。<br><br>&ensp;&ensp;&ensp;&ensp;朵莉亚是来自大海深处的人鱼少女，会伪装成人类在海都“寻宝”，她同时也是人鱼族最有潜力的歌者。<br><br>&ensp;&ensp;&ensp;&ensp;朵莉亚出生于深海中的人鱼族，孩童时代的她便已被族人寄予厚望。小时候，在寻宝”的途中救下了海都命运家族少主海诺，两人从此成为两小无猜的“秘密伙伴”。后来的朵莉亚为平息海底深渊巨兽的危机，选择让狂躁的巨兽吞噬掉俩人最美好的情感以平息动乱。两人在之后皆失去有关对方的记忆，为找到失去的记忆，朵莉亚加入火鹰号，并打算前往珊瑚岛寻找传说中能帮忙唤回失落记忆的“宝物”。",

	//暗黑破坏神
	"xjzh_diablo_kelike":"《暗黑破坏神》的科里克是守护亚瑞特巅峰的三名古代守护者之一，同时他也是野蛮人“野禽”部族的前任领导者。在担任部族领袖期间，科里克的主要职责就是保护他的族民免受野兽和敌对部族的侵袭与骚扰。",
	"xjzh_diablo_lamasi":"《暗黑破坏神》中的游戏角色，初代死灵法师",
	"xjzh_diablo_moruina":"《暗黑破坏神》中的第一个游侠，和其他角色一起建立了罗格营地",
	"xjzh_diablo_kaxia":"《暗黑破坏神》中的弓箭手首领，莫瑞娜的好朋友",
	"xjzh_diablo_yafeikela":"《暗黑破坏神》中的德鲁伊首领，据说德鲁伊和野蛮人同宗同源",
	"xjzh_diablo_lilisi":"莉莉丝是游戏《暗黑破坏神IV》中的角色。莉莉丝为憎恨之王墨菲斯托的女儿、庇护所的创造者。",
	"xjzh_diablo_nataya":"游戏《DIABLO II》（暗黑破坏神II）ACT3库拉斯特海港中的一个NPC。一个被雇佣的女杀手，同时也是刺客宗族费斯贾塔（Viz-jaq'tarr）的一员。",

	//地下城与勇士
	"xjzh_dnf_jianshen":"只有运用剑术到极致的强大剑士才能获此殊荣，至此方可攀上神剑之巅。",
	"xjzh_dnf_shengqi":"圣骑士是在贝尔玛尔大圣堂里受到神的保佑的法师。他们的职责是保护队员的安全。",
	"xjzh_dnf_suodeluosi":"真正的剑魂索德罗斯，精通数万种武器，具有可以与周围的武器产生共鸣的特殊天赋，在战斗中可以发挥强大的威力。",

	//西游释厄传
	"xjzh_xyj_sunwukong":"孙悟空（又称齐天大圣、孙行者、斗战胜佛），是中国古典神魔小说《西游记》中的主要角色之一（传为吴承恩所著）。由开天辟地产生的仙石孕育而生，出生地位于东胜神洲的花果山上，因带领猴群进入水帘洞而被尊为“美猴王”。为了学艺而漂洋过海拜师于须菩提祖师，得名孙悟空，学会大品天仙诀、地煞数七十二变、筋斗云等高超的法术。",


};

export default characterIntro;