import { lib, get, _status, ui, game, ai, rootURL } from '../../../../../noname.js';
//import extensionInfo from '../../../info.json';

const extensionInfo = await lib.init.promises.json(`${lib.assetURL}extension/仙家之魂/info.json`);

export const updateLog = {
	version: `${extensionInfo.version}`,
	onlyVersion: `${extensionInfo.onlyVersion}`,
	5.08132: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.5",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"与美元杀联动，现在使用仙魂武将或者美元杀武将对局胜利即可触发对局奖励",
				"与美元杀联动，添加5种品质的美元宝箱，可打开宝箱获得随机数量的美元杀货币",
				"与美元杀联动，现在使用仙魂武将或者美元杀武将对局胜利可获取美元杀货币",
				"在恩赐的抽奖池中加入的美元宝箱",
			],
			"功能性更新": [
				"现在可以在背包内查看符文详情内容",
			],
			"错误修正": [
				"修复移动端打不开背包和符文界面",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"优化了恩赐界面抽奖的结果和动画的显示效果",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.08131: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.5",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复noAddBuff拼写错误导致某些不会被负面状态影响的武将被施加负面状态",
				"修复升华试炼神张角〖青领〗错误召唤多个黄巾兵",
			],
			"平衡性更新": [
				"调整了升华试炼相关的所有模式，现在玩家的武将牌会在0号位",
				"调整了升华试炼相关的所有模式，现在玩家的只会操作0号位的武将即玩家选将时的第一个武将",
			],
			"其他内容": [
				"将本扩展部分用的alert替换自写函数，防止非必要的阻塞线程",
				"优化会员中心的打开速度",
				"重写了GM工具和存档管理，现在合并为工具箱，可在扩展设置界面打开",
				"优化升华试炼副本选择界面副本列表显示效果",
				"移除了所有升华试炼旧版的门票材料，如咕噜头颅等，改为了巢穴钥匙，旧版材料会以10:1自动转换",
				"重写了材料背包，现在更新为背包",
				"重写符文背包，添加了每个符文对应的素材",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.07061: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复张宁〖雷祭〗报错",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.06301: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复神张角〖电刑〗无限循环",
				"修复昔日烈火〖机变〗报错",
				"修复buff【目盲】拼写错误",
				"修复buff【易伤】拼写错误",
				"修复buff【定身】拼写错误",
				"修复减益buff列表拼写错误",
				"修复多处与buff相关的函数名拼写错误",
				"修复南华老仙〖仙授〗函数名拼写错误",
				"修复卡牌【卡德兰戒】拼写错误导致防具牌无法被反射",
				"修复暴击函数拼写错误导致的暴击始终不会触发",
				"修复暴击函数拼写错误导致的暴击始终不会触发",
				"修复召唤函数拼写错误导致召唤物AI错误",
				"修复魔力函数拼写错误导致的魔力判断出错，导致有魔力的武将出现预期外的错误",
				"修复清除buff函数一处逻辑错误",
				"修复交换判定区的牌函数一处逻辑错误",
				"修复都瑞尔〖恶行〗函数名拼写错误导致的报错",
				"修复游侠〖分裂〗函数名拼写错误导致的报错",
				"修复李白〖侠行〗传递参数错误导致技能不生效",
				"修复李白〖剑歌〗一处拼写错误导致技能不生效",
				"修复花木兰〖刀锋〗报错",
				"修复小乔〖额眉〗一处函数名拼写错误导致的报错",
				"修复索德罗斯〖剑意〗函数拼写错误导致判断错误",
				"修复孙悟空〖如意〗AI参数拼写缺失的错误",
				"修复卡片片【驽马】AI参数拼写缺失的报错",
				"修复黄毓珂〖伤情〗报错",
				"修复憎恨王座挑战奖励内容拼写错误导致不发放奖励",
				"修复奇术要件“泰瑞尔之力”报错",
				"修复分解奇术要件时game.xjzh_loseEquip(item)被调用两次",
				"修复元歌〖控偶〗数组计算未加长度判断返回NAN报错",
				"修复东方曜〖归尘〗只要发动就移除濒死阶段效果的bug",
				"修复东方曜〖归尘〗init条件错误",
				"修复神吕布〖修罗〗result写错导致技能无损释放",
				"修复呼魔符文names拼写错误",
				"修复对局结束奖励发放可能出现的错误",
				"修复南华老仙〖论道〗报错",
				"修复拉马斯〖魂火〗报错",
				"修复魔力-每回合回蓝计算错误",
				"修复xjzh_playBackgroundPicture()this指向错误",
				"修复林默〖真纹〗技能效果与描述一致",
				"修复锐眼〖弹幕〗技能发动条件错误",
				"修复张春华〖慧识〗武将id拼写错误导致封锁技能失效",
				"修复背景图片设置函数this指向的问题",
				"修复复制文件函数catch内变量作用域错误的问题",
				"修复荀攸〖奇策〗判断条件错误导致技能发动效果出错",
				"修复海月〖别月〗prompt条件语句错误导致日志显示出错",
				"修复冯媛媛〖寻情〗mrk数量显示错误",
				"修复技能〖圣辉〗暂不存在导致某些情况下导致的报错",
				"修复buff【目盲】条件判断错误导致buff不会发动的bug",
				"修复奇术要件“复仇之笼”未正确储存伤害",
				"修复升华挑战-无尽模式某些buff不生效",
				"修复升华挑战-巨口深坑开启强化boss且材料足够时boss未被强化",
				"修复增益技能〖天择〗条件判断错误",

			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03091: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复获得经验时没有升级也会触发升级函数显示特效",
				"修复秋凉明“奇思爆破”成就无法完成的错误",
				"修复秋凉明“奇思爆破”成就文本显示错误",
				"修复莫轻言〖藏剑〗报错",
			],
			"平衡性更新": [
				"调整秋凉明〖聚能〗，锁定技和非锁定技的数量不计算武将牌上原有的技能",
			],
			"其他内容": [
				"优化莫轻言〖藏剑〗标记显示效果",
				"完成成就的动画使用和升级一致的动画",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03091: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增秋凉明的武将称号和基础成就",
				"新增秋凉明武将成就“奇思爆破”",
				"新增秋凉明专属奇术要件“灵感素”",
			],
			"功能性更新": [
				"优化了局内打开奇术要件预览界面",
			],
			"错误修正": [
				"修复东方曜〖裂空〗在目标阵亡后还会继续使用【杀】",
				"修复秋凉明〖抵抗〗获得的技能有效，与描述不符",
				"修复秋凉明〖抵抗〗获得的技能会全部被判断为锁定技",
				"修复奇术要件页面和会员中心显示经验值不一样的错误"
			],
			"平衡性更新": [
				"移除成就“净化恶念”",
				"调整了升华试炼-镇压黄巾的挑战规则"
			],
			"其他内容": [
				"开放了成就奖励领取界面",
				"调整了暴击函数",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03081: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增武将“秋凉明”"
			],
			"功能性更新": [
			],
			"错误修正": [
			],
			"平衡性更新": [
				"重做奇术要件“冰冷技巧”"
			],
			"其他内容": [
				"调整了暴击函数",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_qixia_qiuliangming"
		],
		cards: [
		],
	},
	5.03062: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试可以利用“通关时的自动存档和失败时的自动结算”机制在失败结算后读取存档无限刷关",
				"修复升华试炼-无尽试炼敌方血量初始化为负数",
				"修复升华试炼-无尽试炼读取存档开始的对局玩家会有额外的手牌",
				"修复升华试炼-无尽试炼读取存档开始的对局会显示不正确的手气卡",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03043: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				`新增兑换码“各位元宵快乐”，限时2026.3.1-2026.3.10，<a href="javascript:navigator.clipboard.writeText('各位元宵快乐').then(() => alert('复制成功')).catch(() => alert('复制失败，请手动复制'))">点击此处复制</a>`,
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试炼4,8,12,16关因复制卡牌导致的没有初始手牌",
				"修复升华试炼-无尽试炼偶发性敌方武将没有血量显示",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03042: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				`新增兑换码“各位元宵快乐”，限时2026.3.1-2026.3.10，<a href="javascript:navigator.clipboard.writeText('各位元宵快乐').then(() => alert('复制成功')).catch(() => alert('复制失败，请手动复制'))">点击此处复制</a>`,
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试炼第一关失败再次进入会添加一个敌方武将，现在会替换神吕布为其他武将以降低难度",
				"修复升华试炼-无尽试炼复制卡牌逻辑不正确的bug",
				"修复林默〖默语〗报错",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03041: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.2",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"使用纯css重写了升级提示，之前使用的由十周年功能支持的骨骼特效",
			],
			"功能性更新": [
				"现在game.xjzh_wujiangpai支持模糊匹配武将名"
			],
			"错误修正": [
				"修复升华试炼-无尽试炼第二关及以后关卡没有初始手牌",
				"修复林默〖默语〗报错",
			],
			"平衡性更新": [
				"移除了卡牌【霜燃】",
				"分离了挑战模式和升华模式武将技能等代码，非升华试炼不再加载这些武将和技能",
				"优化了木木枭〖图变〗的技能流程",
				"调整木木枭〖图变〗,现在每回合只能发动一次且移除了令其他角色获得/失去技能以及令自己获得体力上限的效果",
				"调整升华试炼-无尽模式，现在会在第4,8,12,16关分别在复制一次牌堆，尽量防止过牌量过大平局的情况",
			],
			"其他内容": [
				"优化升华试炼-无尽模式存档，现在通过一关后会自动存档，即无论玩家在什么时候（除了第一关）重启游戏，再次打开均可读取存档继续游戏",
				"把用get.tag判断是否伤害卡牌的地方全部换成了get.is.damageCard",
				"draw()函数方法适配本体forResult",
				"由于十周年UI一直更改素材位置，所以完全移除了技能特效代码和素材以及安装素材按钮，如有对卡牌素材有需要，可自行复制",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.03021: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.1",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"使用纯css重写了升级提示，之前使用的由十周年功能支持的骨骼特效",
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试炼第二关及以后关卡没有初始手牌",
				"修复林默〖默语〗报错",
			],
			"平衡性更新": [
				"分离了挑战模式和升华模式武将技能等代码，非升华试炼不再加载这些武将和技能"
			],
			"其他内容": [
				"由于十周年UI一直更改素材位置，所以完全移除了技能特效代码和素材以及安装素材按钮，如有对卡牌素材有需要，可自行复制",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.01221: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.1",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
				"调整了成就页面的成就奖励，现在改为完成成就点击领取奖励，而非之前的自动获取奖励",
				"由于上一项的调整，部分成就奖励还未做完，所以暂时隐藏成就奖励入口",
			],
			"错误修正": [
				"修复黄丹雪〖钟情〗报错",
				"修复增益技能〖梦蝶〗报错",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	5.01212: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.0",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增童渊专属奇术要件“凤凰图”"
			],
			"功能性更新": [
				"调整了成就页面的成就奖励，现在改为完成成就点击领取奖励，而非之前的自动获取奖励",
				"由于上一项的调整，部分成就奖励还未做完，所以暂时隐藏成就奖励入口",
				"调整buff相关，移除“冲突buff”，即buff之间不再存在相冲突的情况，如之前冰缓和燃烧冲突，只能存在一个，现在可以同时存在",
			],
			"错误修正": [
				"修复点击成就页面的奇术要件按钮报错",
				"修复升华试炼-无尽试炼点击挑战报错",
				"修复升华试炼的天赋星图按钮在没有天赋的模式错误显示",
				"修复SP吕布〖鬼躯〗没有正确获取到技能",
				"修复孙悟空〖天火〗报错",
				"修复司马懿〖隐忍〗报错",
				"修复蔡琰〖归汉〗，ai不会选择将技能交给其他角色",
				"修复大乔〖国色〗，会在因〖婉容〗获得的额外回合提示是否发动技能",
			],
			"平衡性更新": [
				"重做游侠",
				"重做张让",
				"调整朵莉亚〖天籁〗，不再失去所有技能且重置契约队友的所有技能",
			],
			"其他内容": [
				"调整了部分buff相关的函数和写法，如有bug请反馈",
				"适配新版本的forResult",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_poe_youxia",
			"xjzh_sanguo_zhangrang",
			"xjzh_wzry_duoliya"
		],
		cards: [
		],
	},
	5.01042: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.11.0",
				"请更新浏览器内核版本至98以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增奇术要件“猎首”"
			],
			"功能性更新": [
				"现在打开“技能特效”按钮会自动检测素材是否在十周年UI扩展目录内且是否完整，如果不存在或不完整会自动复制所有素材",
			],
			"错误修正": [
				"修复亚非克拉〖施虐〗使用牌不回复魔力",
				"修复某些新玩家创建的存档在装备奇术要件时报错",
				"修复魔力面板样式错位",
			],
			"平衡性更新": [
				"调整奇术要件“防具精通”，改为开局获得额外3个防具栏",
				"调整奇术要件“武器精通”，改为开局获得额外3个武器栏",
				"调整召唤相关函数，改为使用本体函数",
				"调整朵莉亚〖天籁〗，改为使用本体函数",
				"调整升级所需经验，改为前期升级所需经验大幅减少，后期升级所需经验大幅提升",
				"调整贵族〖升华〗，由随机获得5个技能改为展示10个技能选择5个技能获得",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.12081: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"在打开头像更换窗口新增了一个“添加头像”按钮，可以自定义头像",
			],
			"功能性更新": [
				"优化扩展界面的打开更新公告，如果info.json中填写的版本号在updateLog中不存在会弹出提示并不执行后续逻辑，而非直接报错",
				"优化奇术要件页面鼠标悬停效果",
				"优化loading信息窗口，现在打开一个信息窗口时如果存在已有的窗口会直接更新窗口文字而不是再创建一个窗口，避免不必要的多次点击和操作",
				"优化了更改头像的性能开销和视觉表现",
				"现在头像加载默认从本扩展预置的头像文件夹加载，但玩家可以自定义头像读取的文件夹或将自己喜欢的头像放进本扩展预置的文件夹",
				"添加头像读取文件夹或了解预置头像文件夹的方法请点击本扩展文件夹根目录的“profile.md”获取"
			],
			"错误修正": [
				"修复1.11.0版本第一次打开游戏提示扩展加载失败（实际上没有加载失败）",
				"修复由于十周年UI更新导致素材目录更改导致安装扩展素材没有安装到预期的目录",
				"修复奇术要件的会员中心修改用户名报错",
				"修复清除存档报错",
				"修复GM工具中的“清除超级会员信息”无效",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"暂无武将调整或修复，如遇bug请反馈",
				"本扩展卡牌只有十周年样式，点击安装素材时会将素材安装到十周年对应文件夹，但是无论你在十周年扩展中选择什么样式的卡牌，本扩展的卡牌始终只会显示十周年样式",
				"《点绛唇》扩展的的战绩记录功能会在扩展加载时根据模式创建一个战绩数据对象，仙魂的升华试炼是在点击进入后才会导入的一个模式，在该扩展的数据中不存在，所以结算时会报错，但是不影响结算结果和游戏内容，介意者可以自行关闭本扩展或不游玩升华试炼。",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.11231: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增奇术要件“神圣树脂”，获取：升华试炼-巨口深坑，该奇术要件为特殊奇术要件，只有有魔力条的角色可以装备"
			],
			"功能性更新": [
				"开放亚非克拉狼人的专属奇术要件要件"
			],
			"错误修正": [
				"修复GM工具中的“无视经验直接满级”和“一键重置等级”无效",
				"修复如果连续多次升级升级提示会被覆盖，现在只显示最新的提示",
				"修复装备技能〖霜燃〗报错",
				"修复格里高利〖电冲〗报错",
				"修复瓦尔申〖残忍〗报错",
				"修复升华试炼-无尽试炼某些buff效果不生效",
				"修复升华试炼-无尽试炼可能会在对局中出现和玩家相同的武将",
				"修复升华试炼-无尽试炼在第五关和第十关没有初始摸牌",
				"修复奇术要件局内按键面板不显示第二个了奇术要件信息",
				"修复亚非克拉专属奇术要件“灵魂烙印”描述与实际效果不符",
			],
			"平衡性更新": [
				"调整马超〖雄兵〗，现在可以选择是否使用【杀】",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.11231: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增奇术要件“神圣树脂”，获取：升华试炼-巨口深坑，该奇术要件为特殊奇术要件，只有有魔力条的角色可以装备"
			],
			"功能性更新": [
				"开放亚非克拉狼人的专属奇术要件要件"
			],
			"错误修正": [
				"修复GM工具中的“无视经验直接满级”和“一键重置等级”无效",
				"修复如果连续多次升级升级提示会被覆盖，现在只显示最新的提示",
				"修复装备技能〖霜燃〗报错",
				"修复格里高利〖电冲〗报错",
				"修复瓦尔申〖残忍〗报错",
				"修复升华试炼-无尽试炼某些buff效果不生效",
				"修复升华试炼-无尽试炼可能会在对局中出现和玩家相同的武将",
				"修复升华试炼-无尽试炼在第五关和第十关没有初始摸牌",
				"修复奇术要件局内按键面板不显示第二个了奇术要件信息",
				"修复亚非克拉专属奇术要件“灵魂烙印”描述与实际效果不符",
			],
			"平衡性更新": [
				"【知识竞赛】的选项现在会被打乱显示",
				"亚非克拉专属奇术要件“灵魂烙印”新增效果，魔力上限减少50点",
				"重做亚非克拉狼人技能及其相关奇术要件",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_diablo_yafeikela"
		],
		cards: [
		],
	},
	4.10091: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增亚非克拉专属奇术要件“灵魂烙印”"
			],
			"功能性更新": [
				"暂时禁用亚非克拉熊人及狼人的专属奇术要件要件"
			],
			"错误修正": [

			],
			"平衡性更新": [
				"重做亚非克拉",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_diablo_yafeikela"
		],
		cards: [
		],
	},
	4.08251: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
				"安装扩展素材取消了对OLUI的支持"
			],
			"错误修正": [
				"修复装备了符文在局内生效报错",
				"修复拉斯玛死灵之书备份无法导出的bug",
				"修复SP张角〖诡道〗报错",
				"修复装备了奇术要件的角色在局内查看奇术要件的按钮在不同布局下出现bug无法点击或者显示异常的bug",
				"修复狱火师所有技能报错，重写了召唤相关的机制"
			],
			"平衡性更新": [
				"调整狱火师〖狱犬〗，不再获得技能〖猎犬〗，而是直接召唤地狱猎犬",
				"十周年UI好像不支持显示势力图片了，所以复制素材暂时取消了复制势力图片到十周年UI文件夹，打开游戏会自动删除十周年UI文件夹下的本扩展势力图片"
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.08221: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增了升华试炼的天赋树系统，目前仅半完成了无尽试炼的天赋树，初始5点天赋点，可通过成就或后续加入的其他操作获取额外的天赋点",
			],
			"功能性更新": [
				"升华试炼的选将可以显示最近选将",
				"取消了限制升华试炼-无尽试炼的自由选将",
			],
			"错误修正": [
				"修复奇术要件“复仇之笼”报错",
				"修复增益技能〖超体〗报错",
				"修复升华试炼-亡灵禁界挑战获胜后解放灵魂未保存",
				"修复拉斯玛〖魂火〗在亡灵禁界中发动报错",
				"修复司马懿〖隐忍〗获得衍生技能错误",
				"修复都瑞尔〖幻身〗报错",
				"修复升华试炼-无尽试炼模式的商店在移动端显示道韵字体过小看不清的问题",
			],
			"平衡性更新": [
				"现在在升华试炼-无尽试炼模式的商店中点击“成就”按钮，不再显示“升华试炼按钮”，点击“仙魂宝录”不受影响",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.08041: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
				"SVIP现在支持连续购买，即在剩余的时间上直接增加，而不是重置为30天",
				"恩赐抽奖现在可以抽中会员卡，获得会员卡时直接兑换为会员天数"
			],
			"错误修正": [
				"修复一个在创建初始存档且没有奇术要件的情况下，奇术要件页面不显示任何奇术要件的错误",
			],
			"平衡性更新": [
				"调整奇术要件“武器精通”、“防具精通”效果",
			],
			"其他内容": [
				"在4.07111中修改了奇术要件和成就的存档方式，并为此写了一个将旧存档转为新存档的兼容代码，但是为防止之后已转为新存档的玩家可能会出现的bug，本次更新后将不再尝试将旧存档转为新存档",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.08011: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复获得符文或者奇术要件报错",
				"修复符文装备报错",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.07301: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复神张角〖清领〗报错",
				"修复神张角〖电刑〗报错",
				"修复一个可能在装备奇术要件时出现的错误",
			],
			"平衡性更新": [
				"重做SP诸葛亮",
				"调整升华试炼-无尽试炼，第5关和第10关分别会复制一次牌堆，防止不必要的平局",
			],
			"其他内容": [
				"将检测皮肤文件是否存在的代码改为了使用本体函数，以提高兼容性",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_sanguo_spkongming"
		],
		cards: [
		],
	},
	4.07111: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
				"奇术要件存档和成就存档合并为了一个存档",
				"所有存档修改了Key，所以所有存档均会重置",
				"游戏更新时会尝试将旧存档转为新存档，无论是否成功，均会删除旧存档",
			],
			"错误修正": [
				"修复神张角〖清领〗报错",
			],
			"平衡性更新": [
				"调整神张角〖清领〗，现在造成雷属性伤害会直接召集两个黄巾兵至场上",
				"调整升华试炼-无尽试炼商店，显示商店的时候不会再显示技能按钮",
				"调整了背景音乐/图片的配置项，需要重新设置生效",
				"调整GM工具，移除了“一键解锁所有成就”",
			],
			"其他内容": [
				"本次更新将本扩展所有用game.saveConfig储存的信息改为了game.saveExtensionConfig，所以会出现一部分提示，请小心选择",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.07081: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复无尽试炼结算奖励报错",
			],
			"平衡性更新": [
				"调整升华试炼-无尽试炼结算奖励，提高奖励获取",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.07071: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增奇术要件“摇曳之步”，获取途径：升华试炼-巨口深坑",
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复旗木卡卡西〖神威〗报错",
				"修复奇术要件相关数据更新未保存的bug",
				"修复奇术要件“还击”报错",
				"修复SVIP购买后当天时间计算错误显示不是SVIP"
			],
			"平衡性更新": [
				"调整会心机制，之前未定义则默认为0.1，现在为0",
				"调整会心上限，最多为0.85",
				"调整娜塔亚的默认会心几率为0.35",
				"调整对局结束的奖励，现在经验、碎片等各种奖励获取提高",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.07051: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本至91以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增升华试炼-无尽试炼商店BUFF〖连发〗，【杀】和【酒】的使用次数+1",
			],
			"功能性更新": [
				"现在从奇术要件信息页面返回上一页会回到之前的页面，即你从奇术要件“不败王者”的信息页面返回奇术要件页面会显示“不败王者”所在的页面",
			],
			"错误修正": [
				"修复升华试炼-无尽试炼商店BUFF〖铁壁〗，计算距离错误",
			],
			"平衡性更新": [
				"调整司马懿〖隐忍〗，不再锁定体力上限",
				"调整升华试炼-无尽试炼，现在阵亡也会增加3道韵",
				"调整升华试炼-无尽试炼商店BUFF〖强攻〗，将其拆分为〖强攻〗和〖智识〗两个BUFF，分别对应基本牌/锦囊牌造成伤害+1",
				"调整干将莫邪【剑冢】，造成伤害只在武将牌上放一张牌",
				"调整esp孙策【兴吴】，现在获得技能需要发动一次才会再次获得别的技能",
			],
			"其他内容": [
				"更新了由于启动器或者webview内核版本过低的提示文字",
				"将此提示文字出现的时机改为webview版本低于91时出现，与本体要求一致，但因此而使用本扩展产生的报错，概不受理",
				"为防止因启动器或者webview内核版本过低而频繁出现此提示，此提示出现一次后将关闭本扩展，你可以更新后再打开",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.06302: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
			],
			"功能性更新": [
				"在扩展界面新增了一个选项，可以在无尽模式开启全扩武将池",
			],
			"错误修正": [
				"修复黄丹雪〖钟情〗报错",
				"修复文鸯〖批坚〗报错",
				"修复升华试炼-无尽试炼，第7关之后武将人数异常的错误",
				"修复禁用升华试炼奇术要件，但UI未显示，实际上仍然生效的问题",
				"修复升华试炼-无尽试炼商店在手机端字体过小的问题",
				"修复升华试炼-无尽试炼，在开启了初始道韵为999后，仍然锁定最大30道韵的问题",
			],
			"平衡性更新": [
				"调整【摧脉丹】，当目标的技能不符合移除条件或没有技能移除时，直接流失一点体力",
				"调整升华试炼-无尽试炼第一关的BOSS为本体的神吕布",
				"调整升华试炼-无尽试炼商店技能/BUFF字体为楷体，防止技能描述看不清",
				"调整升华试炼-无尽试炼商店技能/BUFF字体大小，调大字体显示，防止技能描述看不清",
			],
			"其他内容": [
				"暂时禁用武将南华老仙",
				"删除武将esp左慈",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.06301: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"升华试炼-无尽试炼商店新增两个BUFF",
				"新增了四个和升华试炼-无尽模式有关的成就，分别对应通关10/30/50/100关，完成可以获得大量奖励，具体在成就界面查看"
			],
			"功能性更新": [
				"在扩展界面新增了和升华试炼有关的选项，可以自行选择是否开启",
				"在升华试炼-无尽试炼商店页面点击退出会记录当前关卡等信息，下次进入会询问是否加载，无论是否均会重置该存档",
			],
			"错误修正": [
				"修复升华试炼-无尽试炼复活次数用完可以通过“退出”存档再进入对局",
				"修复升华试炼-无尽试炼复活次数用完后仍可以开始对局",
				"修复升华试炼-无尽试炼商店出售技能报错",
				"修复升华试炼-无尽试炼商店购买技能/BUFF没有保存",
				"修复升华试炼-无尽试炼结束后会错误显示某些游戏按钮",
				"修复升华试炼-无尽试炼进入下一关平局",
				"修复升华试炼-无尽试炼BUFF【誓约】描述与效果不一致",
				"修复升华试炼-无尽试炼玩家技能状态错误",
			],
			"平衡性更新": [
				"在升华试炼模式禁用了奇术要件",
				"调整莫瑞娜〖乱射〗，随机额外目标改为1个",
				"调整莫瑞娜专属奇术要件“猎天弓”，令莫瑞娜〖乱射〗的额外目标改为2个",
				"调整升华试炼-无尽试炼道韵的储存有上限，最多为30，所以在每一关结束后尽量消耗道韵",
				"调整升华试炼-无尽试炼进入下一关获得的道韵（货币），在每一关的基础上+2，最大为12",
				"调整升华试炼-无尽试炼初始道韵（货币），初始为6道韵，即当你通过第一关第一次进入商店会有10道韵",
				"调整升华试炼-无尽试炼选将，提供20个选择，不再开放自由选将和随机更换",
				"调整升华试炼-无尽试炼击杀奖励，击杀摸两张牌",
				"调整升华试炼-无尽试炼手气卡，每次进入下一关，可以使用3次手气卡",
			],
			"其他内容": [
				"新增了两个验证，如遇到“本扩展不兼容的扩展”，会自动删除本扩展，考虑到性能的问题，验证的方法比较简单",
				"优化了莫瑞娜〖灌注〗的选牌流程",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.06251: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上",
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="https://qm.qq.com/q/rYxpDg4bvi" target="_blank">点击这里</a> 申请入群`,
				`更新将首先在《仙家之魂扩展交流群》发布，<a href="javascript:navigator.clipboard.writeText('1028575505').then(() => alert('QQ群号复制成功')).catch(() => alert('复制失败，请手动复制：1028575505'))">点击复制QQ群号1028575505申请入群</a>`,
			],
			"新增内容": [
				"新增三张背景图片",
				"新增升华试炼-无尽试炼商店，之前的buff获取，技能获取均改为商店兑换（感谢“锟斤拷烫烫烫”的代码和素材支持）",
				"新增花木兰动态皮肤“水晶猎龙者”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增朵莉亚动态皮肤“金色潮汐”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增李白动态皮肤“碎月剑心”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增李白动态皮肤“凤求凰”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增李白动态皮肤“醉月谪仙”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增干将莫邪动态皮肤“画中仙”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增东方曜动态皮肤“器灵·螭龙剑”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增海月动态皮肤“金乌负日”，需安装金庸群侠传/金庸换肤并打开角色页面",
				"新增魔力回复特效，但获得魔力上限时以及开局时不再显示特效",
			],
			"功能性更新": [
				"在升华试炼-无尽试炼商店页面点击退出会记录当前关卡等信息，下次进入会询问是否加载，无论是否均会重置该存档",
			],
			"错误修正": [
				"修复增益技能〖疾风〗报错",
			],
			"平衡性更新": [
				"升华试炼-无尽试炼的结算方式改变，细节请点击升华挑战主页面-无尽试炼的详情查看",
				"在升华试炼模式禁用增益技能",
			],
			"其他内容": [
				"将“仙魂成就”改名为“仙家宝录”",
				"为卡牌新增了语音，均为ai合成",
				"移除卡牌【无限】",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.06161: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增魔力面板，魔改自本体的武将界面，点击魔力条即可打开",
				"新增拥有魔力数据的武将每回合回蓝",
				"新增符文【酋首符文】",
			],
			"功能性更新": [
				"将本扩展所有描述中带有“魔力/能量”的字样统一为“魔力”",
			],
			"错误修正": [
				"修复罗什巴赫〖祝福〗，未装备奇术要件“天使之悲悯”时无法选择目标",
			],
			"平衡性更新": [
				"调整了双将魔力的计算，之前只生效主将的魔力，现在改为主将和副将之和的二分之一，会心几率、消耗减免等亦然",
				"调整符文组合，现在专属奇术要件装备了的符文组合，普通奇术要件依然可以装备这一符文组合，反之亦然",
				"调整金刃符文获得的贡品数量，由30改为35",
				"调整烈焰符文获得的贡品数量，由60改为65",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [
		],
	},
	4.06131: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增武将罗什巴赫（地下城与勇士-圣骑士）",
				"新增罗什巴赫专属奇术要件“天使之悲悯”，挑战升华试炼-冰川极地获得",
				"新增大量背景音乐"
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复名词解释窗口报错",
				"修复升华试炼-无尽试炼，进入下一关敌方部分角色未摸牌",
				"修复升华试炼-无尽试炼，进入下一关玩家技能标记状态未更新",
				"修复有魔力的武将如果阵亡复活或意外移除魔力面板无法再显示",
				"修复esp孙策〖魂资〗，可以造成属性伤害的bug",
			],
			"平衡性更新": [
				"调整升华试炼-无尽试炼，现在进入下一关会执行一次洗牌",
				"调整升华试炼-无尽试炼，现在进入下一关不会再重置增益技能",
				"调整张角〖电界〗，将其拆分为〖电界〗〖弘法〗两个技能",
				"现在抽奖和兑换不能再抽取/兑换专属奇术要件，具体获得方式查看奇术要件具体信息",
				"奇术要件“不败王者”现在被移除抽奖奖池",
				"调整奇术要件“不败王者”的获取方式，改为挑战升华试炼-憎恨王座和兑换，价格改为5000碎片",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_dnf_luoshibahe"
		],
		cards: [

		],
	},
	4.06041: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增文鸯成就“披坚执锐”",
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复SP张角〖方术〗，选择牌的颜色错误",
				"修复亚非克拉〖灵兽〗，开局未获得标记",
				"修复大熊小猫〖熊猫〗，变更体力值错误",
			],
			"平衡性更新": [
				"调整升华试炼-无尽试炼，现在进入下一关可以选择获得增益",
				"调整升华试炼-无尽试炼，现进入下一关只会保留玩家初始的技能和增益获得的技能，但是会重置玩家所有技能",
				"调整司马懿〖奇才〗，优化了选牌逻辑",
				"调整林嘉笙〖妙法〗，现在组合技若有所需的前置技能不会被获得",
				"调整林嘉笙〖妙法〗，“游戏开始时”不再触发该技能",
				"从兑换商店移除文鸯专属奇术要件“风雷鞭”，可通过完成成就、抽奖、对局获得",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [

		],
	},
	4.06031: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增文鸯专属奇术要件“风雷鞭”",
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复拉斯玛〖魂火〗，首次导入扩展死灵之书为空导致报错",
			],
			"平衡性更新": [
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [

		],
	},
	4.06021: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.2",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试炼，第五关boss会被新增的敌方覆盖",
			],
			"平衡性更新": [
				"调整升华试炼-无尽试炼，为防止平局，进入下一关玩家会弃置所有牌，然后摸4张牌",
				"调整升华试炼-无尽试炼，现在需要击败所有敌方武将才能进入下一关",
				"调整升华试炼-无尽试炼，提高了完成挑战时的经验奖励",
				"调整升华试炼-无尽试炼，奖励获取的材料暂时删除了目前未用到的材料",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [

		],
	},
	4.05271: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复升华试炼-无尽试炼，进入下一关玩家体力未回复的bug",
				"修复升华试炼-无尽试炼，获得胜利未获得奖励",
				"修复升华试炼复活次数未更新的bug",
				"修复莫轻言〖剑胎〗，动态描述显示错误",
			],
			"平衡性更新": [
				"调整升华试炼-无尽试炼，进入下一关玩家体力回复为武将定义的体力值，而不是直接回复到体力上限",
				"调整升华试炼-无尽试炼，进入下一关玩家不再移除所有额外技能",
				"调整升华试炼-无尽试炼，进入下一关玩家不再弃置所有牌",
				"调整升华试炼-无尽试炼，进入下一关不再重置所有技能，防止不可预见的bug",
				"调整SP张角〖布教〗，将其拆分为〖布教〗和〖诡道〗",
				"调整SP张角〖布教〗，添加了初始两张“布教”牌",
				"调整SP张角〖布教〗，现在该技能会增加手牌上限，每一种类型的“教”加1",
				"调整SP张角〖诡道〗，现在该技能可以响应牌",
				"调整SP张角〖太平〗，重做该技能效果",
				"调整SP张角〖方术〗，重做该技能效果",
			],
			"其他内容": [
				"更新了仙武三国包-SP张角的原画",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_sanguo_spzhangjiao",
		],
		cards: [

		],
	},
	4.05261: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增升华试炼-无尽试炼，此模式可以无限闯关，可以在此模式刷经验值、碎片、材料",
				"新增了卡夏〖箭雨〗技能特效",
			],
			"功能性更新": [
				"重新显示了“露头皮肤”选项，默认关闭，现无露头皮肤"
			],
			"错误修正": [
				"修复东方曜〖归尘〗，装备装备牌报错",
				"修复莫轻言〖御剑〗报错",
				"修复宇智波佐助〖千鸟〗，无法正确触发〖六道〗",
			],
			"平衡性更新": [
				"升华试炼模式禁用了技能〖灭却〗〖吞噬〗〖倒戈〗〖梦蝶〗〖魂牵〗",
				"升华试炼模式禁用了武将张让",
				"调整华雄〖耀武〗，使用牌现在无距离次数限制",
				"调整莫轻言〖藏剑〗〖剑胎〗，为其动态描述代码添加了可选链运算符，以解决一些读取动态描述的技能报错",
				"调整卡夏〖箭雨〗，现在冷却时间计算会在技能结算后开始",
				"调整曹操〖归心〗代码，while循环改为了do-whle循环，保证技能至少能发动一次",
				"调整神张角成就驱雷掣电完成方式和次数，具体内容打开成就页面查看",
			],
			"其他内容": [
				"更新了地下城与勇士包-索德罗斯的原画",
				"更新了暗黑破坏神包-卡夏的原画",
				"更新了暗黑破坏神包-亚非克拉的原画",
				"更新了暗黑破坏神包-亚非克拉-狼的原画",
				"更新了暗黑破坏神包-亚非克拉-熊的原画",
				"更新了流放之路包-决斗者的原画",
				"更新了流放之路包-女巫的原画",
				"更新了流放之路包-锐眼的原画",
				"更新了众星之魂包-莫轻言的原画",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_wzry_yao",
		],
		cards: [

		],
	},
	4.05161: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [
				"新增了卡夏〖箭雨〗技能特效",
			],
			"功能性更新": [
				"重新显示了“露头皮肤”选项，默认关闭，现无露头皮肤"
			],
			"错误修正": [
				"修复华雄〖耀武〗，已选择使用的牌不会从数组中移除导致可以选择牌但无法使用牌",
			],
			"平衡性更新": [
				"升华试炼模式禁用了技能〖灭却〗〖吞噬〗〖倒戈〗〖梦蝶〗〖魂牵〗",
				"升华试炼模式禁用了武将张让",
				"调整华雄〖耀武〗，使用牌现在无距离次数限制",
				"调整卡夏〖箭雨〗，现在冷却时间计算会在技能结算后开始",
				"调整曹操〖归心〗代码，while循环改为了do-whle循环，保证技能至少能发动一次",
				"调整神张角成就驱雷掣电完成方式和次数，具体内容打开成就页面查看",
			],
			"其他内容": [
				"更新了暗黑破坏神包-卡夏的原画",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_diablo_kaxia",
		],
		cards: [

		],
	},
	4.05122: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [

			],
			"功能性更新": [
				"现在购买SVIP会实时刷新会员中心的数据",
				"现在使用作弊器会实时刷新数据",
				"作弊器新增“获得所有符文各1个”",
			],
			"错误修正": [
				"修复貂蝉〖月魂〗无限循环",
				"修复张辽〖止蹄〗，目标所有装备栏已废除会报错",
			],
			"平衡性更新": [
				"调整貂蝉〖月魂〗为非锁定技",
			],
			"其他内容": [
				"更新了王者荣耀包-朵莉亚的原画",
				"调整了SVIP的购买价格",
				"重做了会员中心，点击奇术要件页面的用户头像或用户信息进入",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_sanguo_zhangliao",
			"xjzh_sanguo_diaochan",
		],
		cards: [

		],
	},
	4.05121: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [

			],
			"功能性更新": [

			],
			"错误修正": [
			],
			"平衡性更新": [

			],
			"其他内容": [
				"重做了会员中心，点击奇术要件页面的用户头像或用户信息进入",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
		],
		cards: [],
	},
	4.05111: {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上"
			],
			"新增内容": [],
			"功能性更新": [],
			"错误修正": [
				"修复马超〖雄兵〗AI报错",
				"修复大熊小猫的〖天书〗报错",
			],
			"平衡性更新": [
				"重做貂蝉",
				"如果未安装《金庸群侠传》，禁用大熊小猫的〖天书〗",
				"联机模式禁用了女巫的〖猎犬〗"
			],
			"其他内容": [
				"将本扩展的“星”势力的id由“XING”改为“xjzh_xingGroup”",
				"联机模式添加禁用林嘉笙、向婉茹、吴玉凤、大熊小猫、木木枭、关羽、曹操",
				"修复许多bug",
				"优化许多细节"
			],
		},
		players: [
			"xjzh_meiren_linjiasheng",
			"xjzh_meiren_xiangwanru",
			"xjzh_meiren_wuyufeng",
			"xjzh_qixia_daxiongxiaomao",
			"xjzh_sanguo_caocao",
			"xjzh_sanguo_guanyu",
			"xjzh_qixia_mumuxiao"
		],
		cards: [],
	},
	'4.05084': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上",
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
			],
			"平衡性更新": [
			],
			"其他内容": [
				"联机模式添加了禁用列表，进入该模式这些机制武将将被禁用，可在下方查看列表",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [
			"xjzh_sanguo_espsunce",
			"xjzh_sanguo_ganning",
			"xjzh_sanguo_zhoutai",
			"xjzh_sanguo_diaochan",
			"xjzh_sanguo_nanhua",
			"xjzh_sanguo_lvbu",
			"xjzh_sanguo_yuanshao",
			"xjzh_sanguo_yuji",
			"xjzh_sanguo_zhangrang",
			"xjzh_sanguo_espliuxie",
			"xjzh_zxzh_linmo",
			"xjzh_poe_guizu",
			"xjzh_wzry_yuange",
			"xjzh_diablo_lamasi",
			"xjzh_diablo_yafeikela",
			"xjzh_dnf_suodeluosi"
		],
		cards: [],
	},
	'4.05083': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17.1",
				"请更新浏览器内核版本最低120以上",
			],
			"新增内容": [
			],
			"功能性更新": [
			],
			"错误修正": [
				"修复李白〖侠行〗，有4道剑气时未解锁〖剑歌〗",
			],
			"平衡性更新": [
				"调整赵玉姝〖春宵〗，移除了场上有春宵标记时进攻距离无限",
				"调整赵玉姝〖春宵〗，受到伤害不再摸牌",
				"调整李白〖侠行〗，解锁〖剑歌〗时摸4张牌",
				"调整李白〖侠行〗〖剑歌〗，解锁〖剑歌〗不再执行额外回合",
				"赵玉姝的技能做了联机适配",
				"李白的技能做了联机适配",
			],
			"其他内容": [
				"添加了nofire验证，但是无名杀代码开源，所以依然可以被修改",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'4.05071': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.17",
				"客户端需使用1.10.17要求的客户端版本且浏览器内核版本为128以上的客户端"
			],
			"新增内容": [
				"新增“亡灵禁界”升华挑战，用于获得精魄奖励和解放灵魂",
				"添加了一个隐藏的作弊器，自行寻找位置",
				"在奇术要件页面新增了设置用户头像功能",
				"新增了升级动画",
				"新增附加BUFF时的一个简单的动画",
				"新增BUFF燃烧技能动画",
				"新增旗木卡卡西〖神威〗技能特效",
				"设置头像新增支持裁剪为正方形图片（显示为圆形）",
				"升华挑战新增玩家阵亡复活，一局至多复活10次",
				"知识竞赛新增10道题",
			],
			"功能性更新": [
				"清除存档改为了选项，可以自由勾选清除哪一个存档",
				"更新了“显示FPS”的函数实现以及设置的位置",
				"SVIP权益完整支持，更多权益正在增加中...",
				"设置头像的图片加载初始会显示两行图片，后续图片使用懒加载",
				"添加了升华模式保底检测，游戏中或者游戏结束后可以点击重来再次进入该模式，但是会检测材料是否充足，否则会跳转到身份模式",
			],
			"错误修正": [
				"修复一些文件导入模块路径错误导致的报错",
				"修复$huanxing()函数的错误导致拉马斯的〖魂火〗触发不正常",
				"修复拉马斯唤醒的武将〖尸爆〗触发不正常",
				"修复林默〖真纹〗，其他角色获得该技能时会触发该技能询问是否失去该技能",
				"修复狱火师〖尸傀〗，未添加前置检测导致召唤物召唤错误",
				"修复梦刘协〖天命〗，调整usable以适应新版本",
				"修复孙权〖制衡〗，调整usable以适应新版本",
				"修复元歌所有技能，因存档数据结构错误导致的报错",
				"修复武将界面上的查看奇术要件按钮内部的符文错位",
				"修复奇术要件判断条件优先性的问题导致在乱斗模式报错",
				"修复game.xjzh_addPlayer函数使用异步导致的报错",
				"修复符文背包界面会在移动端等小屏设备上图片错位",
				"修复符文装备时会检测“不败王者”上已装备符文的问题",
				"移除装备奇术要件选择武将时的筛选，这会导致在移动端无法选择",
				"修复郭嘉〖天机〗，未声明变量导致报错",
				"修复司马懿〖奇才〗，变量赋值错误报错",
				"修复奇术要“不败王者”装备符文界面显示错误的问题",
				"修复部分符文组合可能会引起循环套用而报错的问题，所以添加了符文禁止组合列表",
				"修复高雨〖淑美〗，当展示的牌中有花色数量相同时，只会获得一种花色的牌",
				"修复高雨〖绝色〗，以红色牌指定目标时，高雨不会执行另一项",
				"修复司马懿〖奇才〗报错",
				"修复高雨〖绝色〗，高雨执行摸牌时，摸牌数量错误",
				"修复卡牌【命运硬币】，ai使用此卡牌的逻辑混乱",
				"修复大乔〖婉容〗，额外回合不生效",
				"调整大乔〖国色〗，规范描述和代码一致",
				"修复陆逊〖武略〗，ai发动技能报错",
				"修复马超〖雄兵〗，for循环改为for-of循环未更改变量报错",
				"修复孙权〖吴盟〗，未写await导致数据未获取报错",
				"修复sp吕布〖神威〗，变身执行额外回合报错",
				"修复管辂〖卜算〗，mod不生效",
				"修复sp吕布〖神威〗，变身执行额外回合卡死",
				"修复陆逊〖武略〗ai报错",
				"修复管辂〖卜算〗衍生卡牌【昙花一现】报错",
				"修复升华调整在移动端选项卡显示错误",
				"修复升华挑战模式“天堂试炼”切换boss卡死",
				"修复设置头像裁剪可能获取不到数据而报错的bug",
				"修复奇术要件抽奖不显示图片",
				"修复触发暴击时机时报错",
				"修复完成成就时检测是否打开控制台变量不存在报错",
				"修复林默〖真纹〗，其他角色获得该技能时会触发该技能询问是否失去该技能",
				"修复女巫〖秘术〗，额外目标log显示错误",
				"修复莫轻舞〖守桃〗，未把弃置的牌移出游戏",
				"修复旗木卡卡西〖雷切〗，没有“雷”时无法发动技能",
				"修复陆逊〖武略〗报错",
				"修复姜凝脂〖点灵〗ai报错",
				"修复娜塔亚〖陷阱〗技能翻译报错",
				"修复狱火师召唤物“骷髅纵火者”〖燃火〗技能报错",
				"修复东方曜〖归尘〗技能报错",
				"修复孙悟空衍生卡牌【火云刀】无法使用",
				"修复孙悟空〖如意〗mod报错",
				"修复管辂〖卜算〗mod报错",
				"修复索德罗斯〖奥义〗技能报错",
				"修复小乔〖天香〗技能不发动",
				"修复技能特效“旋风”导入失败",
			],
			"平衡性更新": [
				"移除界管辂，技能调整",
				"重做魏延，具体看技能介绍",
				"重做管辂，具体看技能介绍",
				"调整管辂〖卜算〗，移除锁定技标签",
				"调整林默〖禁言〗，现在禁用玩家技能需弃牌",
				"完善了升华试炼【恶念魔窟】的挑战规则",
				"升华挑战新增禁用武将死灵法师拉斯玛",
				"升华挑战模式不再询问手气卡",
				"调整许诸〖虎痴〗，使用基本牌不再选择获得牌，改为可以指定额外一个目标",
				"调整大乔〖国色〗，由〖婉容〗给予的额外回合不再提示发动该技能",
				"调整亚非克拉狼形态专属奇术要件“风暴咆哮”，增加会心几率改为30%，灵力消耗减免改为增加10%-15%",
				"调整拉马斯〖魂火〗，写法改变，上一版本的存档将会被清除",
				"现在将拉马斯的死灵之书存放的灵魂区分玩家和AI，但无论是玩家还是AI存放的灵魂都会被加入禁用列表",
				"现在将拉马斯的不再解放死灵之书的灵魂",
				"调整管辂〖卜算〗，由于这个技能的效果是获得管辂专用衍生牌，其他角色发动技能也无效且可能报错，添加了限制只能管辂发动该技能",
				"调整【命运硬币】，卡牌颜色改为黑色，花色改为黑桃和梅花",
				"调整【命运硬币】牌堆结构，数量由6张改为4张",
				"调整【知识竞赛】，卡牌颜色改为红色，花色改为方块",
				"调整林嘉笙〖甘霖〗，不再防止体力流失",
				"调整孙策【激昂】，具体看技能介绍",
				"升华挑战新增禁用武将死灵法师拉斯玛",
				"升华挑战模式不再询问手气卡",
				"调整元歌【控偶】，武将碎片的初始获取值改为造成伤害为2，使用牌为1，但是这个值会你可用的武将碎片数量增加/减少",
				"调整管辂〖卜算〗，由于这个技能的效果是获得管辂专用衍生牌，其他角色发动技能也无效且可能报错，添加了限制只能管辂发动该技能",
				"调整东方曜〖归尘〗技能描述，不再使用出牌阶段限一次的翻译",
				"调整司马徽〖隐世〗，移除濒死时发动技能",
				"调整林凌&诗雨〖雷法〗，摸牌数量改为手牌数量+1",
				"调整林凌&诗雨〖雷法〗，拼点失败不再技能失效且不再摸牌",
				"调整林凌&诗雨〖结阵〗，具体看技能介绍",
				"调整沐风〖御风〗，具体看技能介绍",
				"调整小乔〖娥眉〗，具体看技能介绍",
				"暂时禁用了奇术要件“分裂箭矢”"
			],
			"其他内容": [
				"第一次导入本扩展，创建奇术要件存档不再提示创建，而是会默认创建一个用户名为你联机名称或为“无名玩家”的存档，稍后你可以在奇术要件界面点击用户名修改",
				"更新了全部奇术要件的图片素材",
				"移除了导入info.json文件后的with",
				"移除了升华挑战选项卡的翻转和缩放动态效果",
				"在联机模式禁用了成就、符文、奇术要件",
				"将部分get.cardPile改为了新版写法",
				"将部分Player.addGaintag改为了gaintag.add()",
				"重做神张角以适应“升华试炼”模式",
				"因原版十周年UI不再支持自动从扩展目录直接显示卡牌素材，故注释掉卡牌美化按钮，如果需要使用本扩展的卡牌素材美化，点击“安装扩展素材即可”",
				"使用Promise.allSettled重写了武将导入所用的Promise.all，以保证不会因为一个模块导入失败而整个武将包导入失败",
				"更新的BUFF“中毒”的骨骼动画",
				"升华挑战模式“天堂试炼”最后的三个boss还未完成，后续会继续更新",
				"升华挑战模式胜利规则暂时使用为获胜即可，以保证没有胜利规则或禁用武将而导致的报错",
				"无名杀首次加载如果是在升华挑战模式，会自动跳转到身份模式",
				"调整了部分武将的ID，使自由选将筛选更容易找到该武将",
				"移除了一些本体已经实现/不常用/未引用的函数",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'4.01221': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.16",
			],
			"新增内容": [
				"新增4阶奇术要件“不败王者”，暂定兑换价格3000，具体介绍请在奇术要件信息页查看，该奇术要件依然可以通过对局/抽奖获取"
			],
			"功能性更新": [
				"优化符文技能标记，现在可以显示贡品数量和符文效果/描述",
				"优化符文装备/卸下，不再重新打开界面即可刷新页面",
			],
			"错误修正": [
				"修复卸下符文时，符文描述不被移除",
				"修复几处get.is.playerNames函数参数未写Player参数可能导致的错误",
				"修复女巫〖秘术〗，可能会导致的ai报错",
				"修复卫士〖白嫖〗，优先检测skills是否存在以解决可能出现的报错",
				"修复莫瑞娜〖灌注〗，优先检测card是否存在以解决可能出现的报错",
				"修复莫瑞娜〖劲射〗，优先检测card是否存在以解决可能出现的报错",
				"修复拉斯玛〖号令〗，可能会导致的ai报错",
				"修复拉斯玛〖号令〗，优先判断目标是否有可使用的伤害卡牌以解决无牌可用导致的报错",
				"修复黄巾方士〖符火〗，代码拼写错误导致的报错",
				"修复神吕布〖修罗〗，代码拼写错误导致的报错",
				"修复神吕布〖奔袭〗，代码参数拼写错误导致的报错",
				"修复司马懿〖奇才〗，可能会导致的ai报错",
				"修复陆逊〖武略〗，可能会导致的ai报错",
				"修复刘备〖轻进〗，没有伤害来源导致报错",
				"修复曹操〖归心〗，storage未定义时导致的mod报错",
				"修复SP诸葛亮〖七星〗，代码拼写错误导致的ai报错",
				"修复甘宁〖游侠〗，可能会导致的ai报错",
				"修复张辽〖辟易〗，技能报错",
				"修复司马徽〖隐世〗，可能会导致的ai报错",
				"修复梦孙策〖激昂〗，可能会导致的ai报错",
				"修复左幽〖通玄〗〖幽变〗，在装备了奇术要件“谐角之冠”后，技能计数错误",
				"修复赵云〖绝境〗，赵云为主公时体力上限不锁定为2",
			],
			"平衡性更新": [
				"调整司马徽〖隐世〗，不再在其他玩家濒死时发动",
				"调整孙权〖制衡〗，移除代码上不必要的usable",
			],
			"其他内容": [
				"鉴于一些原因，本扩展此后更新将不再提供所有我自己制作、购买或请人制作的素材，如有需要，请自行添加素材",
				"移除了大部分的rolaod重启和alert弹窗",
				"优化了奇术要件在武将牌上的按钮，现在会随着切换武将消失",
				"更新了全部奇术要件的图片素材",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'4.01131': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.16",
			],
			"新增内容": [
			],
			"功能性更新": [
				"优化奇术要件分解，不再重新打开界面即可刷新页面",
				"在游戏界面武将左下角添加了一个按钮，可以点击查看已装备的奇术要件和符文",
				"打开界面之后，pc端鼠标悬浮即可显示描述，移动端点击显示描述",
				"所有奇术要件和符文均不再展示技能图标和按钮",
			],
			"错误修正": [
				"修复多个符文生效时，会询问发动哪一个符文效果",
				"修复张角〖神道〗改判不生效",
				"修复部分符文效果不生效",
				"修复双将模式主副将均为仙魂武将时，副将奇术要件不生效",
				"修复左幽〖通玄〗函数拼写错误导致无法发动",
				"修复张辽〖辟易〗被其他角色获得技能会报错",
			],
			"平衡性更新": [
				"调整林嘉笙〖妙法〗，不会再获得元歌的技能",
				"调整张角〖神道〗，不再在每回合开始时选择获得牌",
				"调整张角〖黄天〗，当其为主公时额外获得技能〖义施〗，效果与原〖神道〗类似",
			],
			"其他内容": [
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'4.01091': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.16",
			],
			"新增内容": [
				"新增“符文之语”系统",
				"新增了符文之语的获取方式，获取方式为对局胜利根据本局得分随机掉落一个",
				"新增仪式符文[烈焰符文、寒霜符文、奔雷符文、、淬毒符文、金刃符文]",
				"新增祷告符文[祈愿符文、暴风符文、心灵符文]",
			],
			"功能性更新": [
				"奇术要件现在可以为非仙魂武将装备",
				"奇术要件装备界面选将优化，现在可以筛选更多不同类别的武将",
				"奇术要件装备界面选将默认展示所有武将",
				"奇术要件开关为“为所有武将开启”时，打开装备选将界面可能会带来卡顿，建议设备较差或武将扩展过多的玩家依然选择“仅仙魂武将开启”",
			],
			"错误修正": [
				"修复马超〖铁骑〗ai报错",
				"修复女巫〖猎犬〗召唤物态度值错误",
				"修复女巫〖火球〗伤害不能正确传导",
				"修复狱火师〖狱犬〗初始化错误",
				"调整召唤物召唤代码，以修复召唤物技能不发动的问题",
				"调整检测成就完成的前提条件，修复女巫“地狱之火”成就在8人场无法完成",
				"修复在奇术要件信息页面显示信息错误，采用重新打开页面的方法",
				"修复一处代码错误导致的buff只能对自己使用的bug",
			],
			"平衡性更新": [
				"调整了符文镶嵌的逻辑，相同组合的符文不能镶嵌多个",
				"当你在A奇术要件镶嵌了BC符文，你无法在D奇术要件再次镶嵌AB符文，但是你仍然可以单独镶嵌A或者B符文",
				"调整了“塔姆符文”获得的贡品数量，由50改为25",
			],
			"其他内容": [
				"该版本依然为符文之语测试版，如有bug请反馈",
				"符文是镶嵌/装备在奇术要件上的物品，点开奇术要件，点击法阵按钮即可装备，然后游戏内选将选择装备了该奇术要件的武将即可生效",
				"每个奇术要件可以装备两个符文，仪式符文和祷告符文各一个，即可产生共计一个自定义组合效果",
				"每个武将可以装备3个奇术要件，即可以装备总计6个符文，即产生3个符文效果",
				"调整了符文镶嵌按钮的图片，以至更加美观",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'4.01081': {
		changeLog: {
			"本体版本要求": [
				"本体最低支持版本改为1.10.16",
			],
			"新增内容": [
				"新增“符文之语”系统"
			],
			"功能性更新": [
			],
			"错误修正": [
			],
			"平衡性更新": [
			],
			"其他内容": [
				"该版本为符文之语测试版",
				"符文是镶嵌/装备在奇术要件上的物品，点开奇术要件，点击法阵按钮即可装备，然后选将选择装备了该奇术要件的武将即可生效",
				"每个奇术要件可以装备两个符文，仪式符文和祷告符文各一个，即可产生共计一个自定义组合效果",
				"每个武将可以装备3个奇术要件，即可以装备总计6个符文，即产生3个符文效果",
				"修复许多bug",
				"优化许多细节",
			],

		},
		players: [],
		cards: [],
	},
	'3.12311': {
		changeLog: [
			"本体最低支持版本改为1.10.16",
			"在扩展界面新增一个更新公告查看处，感谢《启动界面美化》的代码支持",
			"修复上个版本“势力切换”代码修改导致的势力切换不生效",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.12291': {
		changeLog: [
			"本体最低支持版本改为1.10.16",
			"新增兑换码“yuandankuaile”，限时2024.12.29-2025.1.2",
			"优化奇术要件界面鼠标滚动，现在鼠标滚动不会再导致奇术要件信息出现多个窗口",
			"新增女巫“地狱之火”成就，完成成就解锁武将“狱火师”",
			"新增女巫升华武将狱火师，该武将需完成女巫成就“地狱之火”解锁",
			"调整花木兰〖巡守〗，目标选择牌不限制花色",
			"调整花木兰〖空烈〗，目标在距离外时不再禁用技能",
			"调整花木兰〖刀锋〗，转换技-阳目标选择牌不限制花色",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_poe_yuhuoshi", "xjzh_wzry_huamulan"],
		cards: [],
	},
	'3.12122': {
		changeLog: [
			"本体最低支持版本改为1.10.16",
			"调整元歌〖控偶〗，元歌被ai操作时该技能不会发动",
			"修复元歌〖秘影〗，ai发动该技能会无限循环",
			"调整元歌〖秘影〗，增加一个标记以查看所有可切换的傀儡",
			"调整拉斯玛，将该武将改为仅点将可用",
			"调整拉斯玛〖魂火〗，优化技能代码",
			"调整拉斯玛〖魂火〗，拉斯玛由死亡之书灵魂中获得技能的数量改为了从每个灵魂中随机获得一个技能",
			"本次更新后，拉斯玛的死亡之书由于写法改变会重置存档",
			"调整拉斯玛〖号令〗，具体看技能介绍",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_wzry_yuange", "xjzh_diablo_lamasi"],
		cards: [],
	},
	'3.12032': {
		changeLog: [
			"为元歌新增一个技能〖纸鸢〗，该技能在切换为傀儡时也会保留",
			"调整元歌〖控偶〗，其他角色获得该技能不可再发动",
			"调整元歌〖控偶〗，使用牌指定多个目标时，若目标包含自己，可以获得除自己之外的其他武将的碎片，而不是之前的完全不获得",
			"调整元歌〖秘影〗，其他角色获得该技能不可再发动",
			"调整元歌〖秘影〗，本体可以在回合外切换为傀儡",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.12032': {
		changeLog: [
			"调整元歌〖秘影〗，主动切换为傀儡不会再需要手动操作再执行下一步操作",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.12031': {
		changeLog: [
			"调整元歌〖控偶〗，在标记中添加了一个简单的碎片数量显示",
			"调整元歌〖控偶〗，现在只要有某一武将碎片，就会显示该武将",
			"调整元歌〖控偶〗，将获得的碎片数量由3个提高到5个",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.12021': {
		changeLog: [
			"重做冯媛媛",
			"重做张辽",
			"移除界马超",
			"新增武将“元歌”,元歌的武将碎片是存档式永久储存",
			"调整武将“esp”前缀，现在将显示为“梦”，对应这些武将的设计取自虚构的另外时间线的故事",
			"新增奇术要件“炼金师之力”",
			"调整奇术要件“疾疫刀尖”，毒属性伤害属性不会再覆盖伤害事件原本的属性",
			"调整马超〖雄兵〗，使用【杀】被闪避不再摸牌，技能结算后不再受到伤害",
			"优化左幽〖通玄〗，优化了技能流程",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_wzry_yuange", "xjzh_zxzh_yuanyuan", "xjzh_sanguo_machao", "xjzh_sanguo_zuoyou"],
		cards: [],
	},
	'3.10282': {
		changeLog: [
			"重做处刑者",
			"新增奇术要件“泰瑞尔之力”",
			"新增成就<a style='color:#FFFF00' href=\"javascript:game.xjzhAchi.openAchievementView('character');\">“微妙玄通”</a>",
			"修复部分拼写错误导致的bug",
			"修复莉莉丝〖憎恨〗报错",
			"修复神张角〖清领〗无法开始额外回合",
			"修复莉莉丝〖强击〗错误",
			"移除buff“暴击球”",
			"调整成就“完美斗士”，完成成就所需击败武将数量改为30",
			"调整成就“刽子手”，完成成就所需击败武将数量改为30",
			"调整成就“火焰大师”，完成成就所需击败武将数量改为30",
			"调整成就“驱雷掣电”，完成成就所需击败武将数量改为50",
			"调整恩赐抽奖概率，所有等级奖励全部增加5%",
			"调整奇术要件“无夜星空之戒”，增伤改为最多+1",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.10071': {
		changeLog: [
			"重做张宝",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_zhangbao"],
		cards: [],
	},
	'3.10051': {
		changeLog: [
			"重做宇智波止水",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_huoying_zhishui"],
		cards: [],
	},
	'3.09281': {
		changeLog: [
			"移除“极略补充”武将包",
			"新增增益技能〖灭却〗",
			"重做sp吕布",
			"修复奇术要件“谐角之冠”，技能次数错误",
			"调整林霜〖清泉〗，出牌阶段分配护甲改为回复体力后令其他角色执行选项",
			"调整林霜〖凛冬〗，具体看技能介绍",
			"调整董卓〖揽政〗，需弃牌的手牌数小于其体力值时获得1点体力上限",
			"调整董卓〖暴敛〗，具体看技能介绍",
			"调整旗木卡卡西〖雷切〗，随机效果改为造成1点雷属性伤害",
			"优化林嘉笙〖妙法〗代码",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_dongzhuo", "xjzh_sanguo_splvbu", "xjzh_huoying_kakaxi", "xjzh_meiren_linshuang"],
		cards: [],
	},
	'3.08251': {
		changeLog: [
			"新增奇术要件“塞利格的溶解之心”",
			"新增奇术要件“无夜星空之戒”",
			"新增卡夏专属奇术要件“哈坎的口谕”",
			"修复莫瑞娜专属奇术要件“猎天弓”，【杀】无法指定自己为目标",
			"调整莫瑞娜专属奇术要件“猎天弓”，使用【杀】不再可以指定自己为目标（测试中发现很容易将自己崩死）",
			"调整卡夏〖速射〗，不再额外造成伤害，使用【杀】额外结算改为至多2次",
			"调整卡夏〖隐蔽〗，不再将武将牌翻至背面",
			"调整卡夏〖箭雨〗，每两轮限一次改为冷却时间120秒",
			"调整卡夏〖箭雨〗，不再造成属性伤害",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_diablo_moruina", "xjzh_diablo_kaxia"],
		cards: [],
	},
	'3.08191': {
		changeLog: [
			"移除莫瑞娜衍生卡牌【猎天弓】",
			"新增莫瑞娜专属奇术要件“猎天弓”",
			"调整恩赐抽奖获取的碎片数量，一次最低5，最高35，提高接近3倍获取量",
			"新增奇术要件“命运之拳”，具体效果请到奇术要件页面查看",
			"新增增益技能〖威讼〗，效果为“其他角色的准备阶段，你可以令其进行一次判定，若为♠，其跳过出牌阶段。”",
			"修复结算时碎片获取量计算错误",
			"修复旗木卡卡西〖拷贝〗，获得的临时技能可以无限制发动",
			"优化旗木卡卡西〖神威〗，优化代码量，改为异步函数",
			"调整旗木卡卡西〖拷贝〗，优化代码，使用addTempSkills函数和本体的useSkill和logSkill时机",
			"调整增益技能〖翩跹〗，优化代码，现在受〖翩跹〗影响的技能不会再影响其他角色获得技能",
			"调整增益技能〖玄变〗，优化代码，现在已被替换的牌不会再出现在选项中，即现在替换是不可逆的",
			"调整莫瑞娜〖乱射〗，弃置[伤害]卡牌随机使用【杀】改为使用【杀】时增加1-3个随机额外目标",
			"调整莫瑞娜〖乱射〗，移除乱射造成伤害令目标获得“目盲”",
			"调整莫瑞娜〖劲射〗，改为指定多个目标时令其中一个目标获得“易伤”",
			"调整莫瑞娜〖灌注〗，新增“毒素灌注”，造成毒属性伤害并附加“中毒”",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_diablo_moruina", "xjzh_huoying_kakaxi"],
		cards: [],
	},
	'3.08022': {
		changeLog: [
			"修复结算时碎片获取量计算错误",
			"调整孙悟空〖如意〗，衍生牌无法再被弃置/获得",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.08021': {
		changeLog: [
			"新增兑换码<a style='color:#FFFF00' href=\"javascript:game.copyTotext('shujialaile');\">aoyunduoguan</a>(点击复制)，截止2024/08/10",
			"修复余木人〖拾櫵〗，发动技能〖抱薪〗移除点数后未重新记录",
			"修复余木人〖抱薪〗，选项可以选择取消",
			"修复余木人〖抱薪〗，选择选项一未摸牌",
			"调整普通对局结束材料获取的概率，当本局得分低于50分时，固定概率为25%",
			"分离【冥狱石】与基础材料获取的概率，冥狱石获取单独计算，概率为25%||50%",
			"调整对局结束基础材料获取的概率，提高1.5倍",
			"调整等级对材料/经验获取的概率，向下取整只在最终计算时使用",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.07311': {
		changeLog: [
			"修复魔力部分代码更新可能会导致的报错",
			"修复武将格式改为对象可能会导致的魔力部分报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.07301': {
		changeLog: [
			"限制扩展最低支持本体版本1.10.14",
			"修复导入扩展之后列表没有“仙家之魂”",
			"修复新版本导入json文件路径更改导致的开屏报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.07171': {
		changeLog: [
			"重做陆逊",
			"新增增益技能〖流转〗，效果为“锁定技，当其他角色弃置牌或失去技能后，你获得之。”",
			"调整左幽〖通玄〗，移除技能列表中的〖翩跹〗",
			"调整索德罗斯〖奥义〗，具体看技能介绍",
			"调整索德罗斯〖剑意〗，具体看技能介绍",
			"调整索德罗斯〖剑神〗，具体看技能介绍",
			"调整索德罗斯5张衍生卡牌效果，具体看卡牌介绍",
			"调整【摧脉丹】以适应增益技能〖流转〗",
			"调整【摧脉丹】，摧脉丹被使用后不再移出游戏",
			"调整【摧脉丹】，牌堆摧脉丹改为2张，之前是4张",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_zuoyou", "xjzh_dnf_suodeluosi", "xjzh_sanguo_luxun"],
		cards: ["xjzh_card_tianjigyx", "xjzh_card_guanshizhengzong", "xjzh_card_julihjc", "xjzh_card_mojianklls", "xjzh_card_tiancongyunjian"],
	},
	'3.07101': {
		changeLog: [
			"调整卡牌【谐角之冠】，将其改为奇术要件",
			"考虑到【练气丹】在局内修改技能代码，影响颇多，故移除【练气丹】及其相关成就",
			"修复董卓〖横征〗，ai无脑硬吃伤害",
			"修复董卓〖凌虐〗，描述与技能效果不符",
			"移除女巫技能〖虚弱〗，改为〖秘术〗",
			"调整元素使〖丧钟〗，具体看技能介绍",
			"调整元素使〖塑形〗，具体看技能介绍",
			"调整元素使〖壁垒〗，具体看技能介绍",
			"调整元素使〖亲和〗，具体看技能介绍",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_poe_nvwu"],
		cards: [],
	},
	'3.07031': {
		changeLog: [
			"为部分具有依赖关系的奇术要件添加了装备前置条件和卸下条件",
			"亚非克拉的专属奇术要件“风暴咆哮”和“瓦西里的祷告”未生效的问题，解释如下",
			"这两件奇术要件需要分别依赖于“疯狼的狂喜”和“无餍之怒”",
			"在未装备相对应的奇术要件或后装备都会使其无效",
			"为几个技能新增了技能特效，需要导入素材到十周年UI，在扩展界面点击安装素材",
			"修复干将莫邪〖淬剑〗未装备武器牌时使用非延时锦囊牌未额外结算",
			"修复了一些技能ai参数填写导致的报错",
			"修复莫轻言〖藏剑〗视为装备的武器牌没有攻击距离",
			"修复亚非克拉狼形态〖雷暴〗报错",
			"修复娜塔亚〖陷阱〗报错",
			"调整曹操〖归心〗，具体看技能介绍",
			"调整蔡琰〖才情〗，移除了选择花色的步骤改为直接摸牌",
			"调整娜塔亚的基础会心几率为50%，之前的会心几率过高导致魔力成为了可有可无的存在",
			"调整buff“中毒”，现在触发中毒减益之后会移除一层中毒",
			"调整亚非克拉〖灵兽〗，即便装备了奇术要件也可以发动技能获得贡品",
			"调整亚非克拉狼形态〖狂吼〗，改为魔力/体力不为最大值时即可发动",
			"调整亚非克拉〖施虐〗，转换魔力值不再以输入框的方式任意输入数字",
			"调整亚非克拉狼形态〖雷暴〗，“选择1名角色对其造成技能等级点伤害”改为“选择技能等级名角色对其造成1点伤害”",
			"优化魔力，现在有魔力条的武将被替换或阵亡（部分情况），会移除魔力条",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_zxzh_moqinyan", "xjzh_sanguo_caocao"],
		cards: [],
	},
	'3.07011': {
		changeLog: [
			"重做武将莫轻言",
			"移除DNF冒险家分包并移除其中所有武将及相关代码",
			"将DNFNPC分包改为地下城与勇士",
			"修正奇术要件“生命复苏”描述与代码一致",
			"修复姜凝脂〖点灵〗ai报错",
			"修复公孙瓒〖白马〗错误",
			"修正公孙瓒〖募马〗描述与代码一致",
			"修复【熔岩铠甲】结算游戏卡住",
			"修复buff“中毒”报错",
			"调整林嘉笙〖甘霖〗，“成为延时锦囊牌的目标获得一张同名牌”改为“不能成为延时锦囊的目标”",

			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_zxzh_moqinyan"],
		cards: [],
	},
	'3.06251': {
		changeLog: [
			"本次更新会重置奇术要件材料",
			"新增兑换码<a style='color:#FFFF00' href=\"javascript:games.copyTotext('shujialaile');\">shujialaile</a>(点击复制)",
			"调整奇术要件的用户名等字体及位置显示，不会再因为窗口缩放而超出容器",
			"暂时隐藏在线更新（文件列表懒得写）",
			"修复部分奇术要件装备后开局时报错",
			"修复导入存档错误",
			"修复部分没有魔力值的武将开局报错（偶发）",
			"调整齐尔领主〖复苏〗，失去牌改为失去红色牌",
			"调整齐尔领主〖感染〗，受到伤害改为造成伤害后",
			"调整扩展界面的播放音乐的随机播放为播放随机本扩展的音乐",
			"调整奇术要件页面，点击用户名可以查看当前玩家（game.me）已装备的奇术要件，若未选将则随机展示一名已装备奇术要件的武将",
			"移除材料咕噜头颅、颤栗之手、发黑的股骨",
			"新增材料针扎娃娃、焦沙枷锁、冥狱石",
			"材料针扎娃娃、焦沙枷锁可以用来开启boss安达利尔挑战（安达利尔boss还没做，所以不会有该boss出现）",
			"冥狱石可以用来强化所有boss，但消耗的材料数量为基础材料的3倍，奖励为2倍",
			"调整材料掉落和boss消耗材料所需，具体可在奖励预览或boss的技能备注中查看",

			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.06231': {
		changeLog: [
			"适配本体1.10.13,并限制本扩展最低支持版本为1.10.13",
			"移除不需要的技能语音文件",
			"新增娜塔亚专属奇术要件“无名者兜帽”",
			"将描述中的“负面状态”改为“控制”",
			"“控制”包含翻面、横置、装备栏被废除、判定区有牌、有减益buff",
			"修复buff“强固”报错",
			"调整魔力相关代码，即时某角色的会心/减免为0也会执行相关代码，以保证计算不出错",
			"修复周泰〖奋激〗报错",
			"修复公孙瓒〖募马〗ai报错",
			"修复大乔/小乔〖离乡〗语音未播放",
			"修复娜塔亚〖陷阱〗报错",
			"调整娜塔亚〖陷阱〗，具体看技能介绍",
			"将奇术要件页分为了专属和通用两个页面",
			"调整专属奇术要件兑换所需的碎片为，x*(1+level)，x为该等阶奇术要件兑换的基础数量，leve为奇术要件的等阶",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.06211': {
		changeLog: [
			"重做公孙瓒",
			"重做干将莫邪",
			"修复大熊小猫〖天书〗报错",
			"修复大熊小猫〖熊猫〗体力上限获取错误",
			"修复亚非克拉在装备了“风暴咆哮”的情况下变形为狼时，会心几率计算错误",
			"修复娜塔亚〖陷阱〗报错",
			"调整技能会心触发几率的计算方法，改为x*(1+y)，x为技能会心触发几率，y为人物的会心几率",
			"调整魔力消耗，当拥有消耗减免时魔力消耗可能有小数点，为避免不必要的麻烦，全部改为四舍五入计算",
			"调整莉莉丝〖强击〗基础概率为20%",
			"调整莉莉丝〖憎恨〗，技能结算后获得技能〖血炎〗",
			"调整孙权〖制衡〗，“每个区域内额外摸1张牌”改为“每种花色”额外摸1张牌",
			"奇术要件主页可以循环滚动鼠标，支持从最后一页直接滚动在第一页，反之亦然",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_bogui", "xjzh_wzry_ganjiangmoye"],
		cards: [],
	},
	'3.06181': {
		changeLog: [
			"调整所有标记威图片的技能的素材，建议安装完整包",
			"新增奇术要件“痛苦吞食者”",
			"将奇术要件的兑换商店按照等阶从小到大排序",
			"修复分解奇术要件后数量不正确的bug",
			"修复给亚非克拉装备奇术要件报错",
			"调整成就完成获取的碎片数量为50",
			"给奇术要件的主页添加了鼠标滚轮滚动页面功能",
			"调整娜塔亚〖陷阱〗，具体看技能介绍",
			"调整娜塔亚〖暴露〗，具体看技能介绍",
			"调整亚非克拉狼形态技能〖雷暴〗，会心几率调整至35%",
			"调整亚非克拉熊形态技能〖粉碎〗，会心几率调整至50%",
			"调整亚非克拉熊形态技能〖粉碎〗，不再适用暴击机制",
			"调整亚非克拉适用的四个奇术要件代码",
			"调整奇术要件，现在装备了奇术要件的角色可以为双将且为副将",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_diablo_nataya"],
		cards: [],
	},
	'3.06141': {
		changeLog: [
			"新增get.xjzh_consumeMp()以获取已消耗的能量",
			"移除get.xjzhMp()和get.xjzhmaxMp()，改为直接以this.xjzhMp和this.xjzhMp获取当前能量值",
			"调整get.isMaxMp()为get.xjzh_isMaxMp()",
			"调整了能量（魔力）相关代码",
			"初始的能量值储存在lib.character[name][5]中，改为对象存储",
			"调整changexjzhMp()和changexjzhmaxMp()，使代码量大幅减少",
			"以上函数的调整使相关时机不再能阻止获得/失去能量或修改获得/失去的能量值",
			"调整xjzhshowMp()，现在能量条能动态显示，且支持圆角显示",
			"现在能量条能的显示，不会再使蓝色部分超出容器，即始终会以圆角显示",
			"现在能量变化时，能量条会缓速变化而不是直接变化",
			"当能量条能量为满值时，添加一个无限闪烁的黄色边框，不为满值时移除",
			"修复黄丹雪〖默情〗报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"audio/skill/xjzh_boss_xiuluo_hp1.mp3",
				"audio/skill/xjzh_boss_xiuluo_hp2.mp3"
			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}
		},
	},
	'3.06121': {
		changeLog: [
			"模块化武将包，如有bug请反馈",
			"移除boss神左幽",
			"修复周泰〖奋激〗，只有玩家获得牌",
			"修复管辂衍生卡牌【神机妙算】报错",
			"在上次调整孙悟空的技能〖如意〗后，在多次对局中均未有机会获得衍生牌，所以做如下调整",
			"调整孙悟空〖如意〗，现在受到火焰伤害也可以获得衍生牌",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"skin/yuanhua/xjzh_boss_zuoyou.jpg",
				"ext/2_XWSG.js",
				"ext/3_XWTR.js",
				"ext/4_XWCS.js",
				"ext/5_XWDM.js",
				"ext/6_XWTZ.js",
				"ext/7_JLBC.js",
			], folderFiles2 = [
				"ext/modules/cards/translate",
				"ext/modules/cards/card",
				"ext/modules/cards/list",
				"ext/modules/cards/skill"

			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}

			for await (let i of folderFiles2) {
				game.xjzh_removeFiles(i);
			}
		},
	},
	'3.06111': {
		changeLog: [
			"新增兑换码<a style='color:#FFFF00' href=\"javascript:game.xjzh_copyToText('duanwuankang');\">duanwuankang</a>(点击复制)",
			"卡牌包改为es_modules，如有bug请反馈",
			"调整卡牌【卡德兰戒】，现在只会反射武器、防具、宝物",
			"调整buff“冰缓”，出牌等待时间改为每层buff减少50%出牌时间（四舍五入）",
			"调整宇智波佐助〖千鸟〗，将技能中的觉醒部分拆分为一个新技能〖六道〗",
			"调整宇智波佐助〖千鸟〗，不再在其他角色回合开始时对佐助使用【杀】",
			"调整宇智波佐助〖瞳术〗，移除了〖炎遁〗",
			"调整宇智波佐助〖瞳术〗，〖天手力〗调整，具体看技能介绍",
			"调整宇智波佐助〖瞳术〗，新增“你计算与其他角色距离始终为1”",
			"调整漩涡鸣人〖嘴遁〗ai，修复ai只会选择阵亡的问题",
			"修复漩涡鸣人〖嘴遁〗，偶尔会出现ai选择更改势力之后未摸牌的问题",
			"修复使用双将时，漩涡鸣人更改武将名错误",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_huoying_mingren", "xjzh_huoying_zuozhu"],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"audio/skill/xjzh_huoying_qianniao_add1.mp3",
				"audio/skill/xjzh_huoying_qianniao_target1.mp3",
				"audio/skill/xjzh_huoying_tongshu11.mp3",
				"audio/skill/xjzh_huoying_tongshu31.mp3",
			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}
		},
	},
	'3.06041': {
		changeLog: [
			"重新开放亚非克拉",
			"新增get.isMaxMp(),用以判断武将的Mp是否是满值",
			"调整奇术要件兑换所需碎片，1阶50,2阶100,3阶150,4阶230,5阶320，其他默认兑换所需50",
			"调整漩涡鸣人〖分身〗，拼点获胜后的摸两张牌改为摸一张",
			"调整奇术要件【疾疫刀尖】，造成毒属性伤害+1不再依靠50%几率",
			"调整奇术要件【复仇之笼】，储存伤害的随机数改为30%-50%",
			"调整奇术要件【复仇之笼】，造成伤害的倍率改为300%",
			"调整奇术要件【药剂师】，触发几率改为25%-40%",
			"调整奇术要件【药剂师】，造成伤害改为当前事件不包含的伤害属性数量",
			"调整奇术要件【剃头师】，伤害提高改为每10s提高70%",
			"调整奇术要件【剃头师】，伤害计算由向下取整改为四舍五入",
			"调整孙悟空〖如意〗，因〖天火〗造成火属性伤害不再获得衍生牌",
			"修复莉莉丝〖强击〗，离开游戏/回到游戏几率错误",
			"修复莉莉丝〖强击〗，回到游戏时不能触发后续操作",
			"修复莉莉丝〖憎恨〗，回复体力值错误",
			"优化莉莉丝〖连击〗代码",

			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.06032': {
		changeLog: [
			"修复孙权〖吴战〗报错",
			"修复孙悟空〖天火〗目标错误",
			"调整漩涡鸣人〖分身〗，拼点获胜后可以选择摸两张牌或回复一点体力",
			"调整漩涡鸣人〖仙术〗，漩涡鸣人移除技能〖仙术〗",
			"调整漩涡鸣人〖嘴遁〗，具体看技能介绍",
			"调整漩涡鸣人〖开挂〗，体力上限为3",
			"调整六道鸣人〖遁术〗，具体看技能介绍",
			"调整六道鸣人〖分身〗，分身体力值与体力上限改为3，手牌改为3",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_huoying_mingren"],
		cards: [],
	},
	'3.06031': {
		changeLog: [
			"修复孙悟空〖天火〗，将牌交给上家时报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.06021': {
		changeLog: [
			"重做武将孙悟空",
			"调整sp华佗〖行医〗，不再可以移除负面状态且不再令sp华佗摸牌",
			"调整sp华佗〖青囊〗，对其他目标发动技能不再令sp华佗获得体力上限",
			"调整sp华佗〖青囊〗，体力值与已损体力值相等时不再提示发动该技能",
			"修复sp华佗〖青囊〗，濒死阶段可以发动该技能",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_xyj_sunwukong", "xjzh_sanguo_sphuatuo"],
		cards: ["xjzh_card_tianganghuo", "xjzh_card_hunyuandan", "xjzh_card_huoyundao", "xjzh_card_dingshenzhou", "xjzh_card_zhaoyaojing"],
	},
	'3.05221': {
		changeLog: [
			"重做武将姜凝脂",
			"重做武将董卓",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_zxzh_jiangningzhi", "xjzh_sanguo_dongzhuo"],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"audio/skill/xjzh_sanguo_zongjiu1.mp3",
				"audio/skill/xjzh_sanguo_zongjiu2.mp3",
				"audio/skill/xjzh_sanguo_zongjiu3.mp3",
				"audio/skill/xjzh_sanguo_zongjiu4.mp3",
			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}
		},
	},
	'3.05081': {
		changeLog: [
			"此版本已适配本体1.10.12且不支持以下版本",
			"修复小乔〖娥眉〗报错",
			"修复庞统〖横舟〗，部分开局横置的角色会在横置后失效",
			"修复卡牌【熔岩铠甲】，伤害计算错误",
			"调整卡牌【熔岩铠甲】AI，现在ai不会再火杀装备了此牌的目标（可能）",
			"调整庞统〖横舟〗，现在庞统阵亡时会恢复被〖横舟〗禁用的技能",
			"调整庞统〖谋略〗，修正技能效果与描述一致",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.05041': {
		changeLog: [
			"重做张宁",
			"新增增益技能〖翩跹〗",
			"移除卡牌【玄铁重甲】",
			"修复boss神张角〖电刑〗，技能报错",
			"修复boss格里高利〖电冲〗，技能效果错误",
			"修复boss格里高利〖电矛〗，技能效果错误",
			"修复林霜〖清泉〗，回复体力获得护甲计算错误",
			"修复奇术要件【坚毅之盾】，回合开始不转化体力上限",
			"调整【熔岩铠甲】，受到伤害不再转为无来源伤害",
			"修复许多bug",
			"优化许多细节",
		],
		players: [
			"xjzh_sanguo_zhangning"
		],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"image/effect/12345.png",
				"image/effect/skill_baozha.png",
				"image/effect/skill_jinzhongzhao.png",
				"image/effect/skill_leiji.png",
				"image/effect/skill_leiji2.png",
				"image/effect/skill_leixuan.png",
				"image/effect/skill_tianlei.png",
				"image/cardimage/tenui/xjzh_card_xuantiezhongjia.webp",
				"image/cardpicture/xjzh_card_xuantiezhongjia.png",
				"audio/skill/xjzh_sanguo_yingbing1.mp3",
				"audio/skill/xjzh_sanguo_yingbing2.mp3",
				"css/images/qishuyaojian/reward_flag.png",
				"css/images/qishuyaojian/jinkuang.png",
			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}
			await game.xjzh_removeFiles("image/effect/gif");
		},
	},
	'3.04281': {
		changeLog: [
			"新增海月技能语音",
			"新增奇术要件【坚毅之盾】",
			"兑换码：labourday0,截止日期2024/05/05",
			"已完成的成就会在本次更新时自动获取奖励",
			"现在完成成就会获得一定量的碎片或精魄奖励",
			"奇术要件第一次新建存档会赠送300碎片和10个精魄",
			"修复索德罗斯成就拼写错误",
			"修复海月〖幻海〗，技能发动后【流光】报错",
			"修复蔡琰〖才情〗，技能失效",
			"修复张角〖神道〗，判定的提示不消失",
			"修复林子言〖雷法〗报错",
			"修复张飞〖杀意〗技能失效",
			"修复张飞〖震魂〗技能失效",
			"修复增益技能〖绕梁〗报错",
			"修复司马懿〖奇才〗报错",
			"修复孙权〖吴战〗报错",
			"修复进入国战报错",
			"调整张角〖神道〗，现在可以取消不选择判定牌",
			"调整张角〖黄天〗，〖界雷击〗改为〖新雷击〗",
			"调整张角〖黄天〗，移除〖影兵〗",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"audio/skill/xjzh_sanguo_yingbing1.mp3",
				"audio/skill/xjzh_sanguo_yingbing2.mp3",
				"css/images/qishuyaojian/reward_flag.png",
				"css/images/qishuyaojian/jinkuang.png",
			];
			for await (let i of folderFiles) {
				game.removeFile(`${lib.assetURL}/extension/仙家之魂/${i}`);
			}
		},
	},
	'3.04171': {
		changeLog: [
			"部分函数使用最新版函数，请更新本体至1.10.11.1",
			"修复小乔〖峨眉〗，获得的技能为男性角色的技能",
			"修复小乔/大乔〖离乡〗，技能发动时卡死",
			"修复余木人〖抱薪〗，技能时机错误",
			"修复增益技能〖梦蝶〗，技能失效",
			"调整sp诸葛亮〖七星〗，非延时锦囊牌改为的任意不同牌名的牌",
			"调整朵莉亚〖欢歌〗，新增已选择契约队友增加2手牌上限",
			"调整余木人〖拾櫵〗，现在不再限制在记录的第一个点数",
			"调整余木人〖抱薪〗，子技能改为锁定技",
			"调整朵莉亚〖逐浪〗，重做该技能",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.04121': {
		changeLog: [
			"调整了成就储存的方式，本次更新会重置成就，请保存成就存档后导入",
			"给司马懿的〖隐忍〗绑定了一个免疫伤害的特效",
			"修复增益技能〖重塑〗替换的出牌阶段未触发",
			"此版本更新及后续更新会自动删除冗余文件",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
		removeFiles: async function () {
			let folderFiles = [
				"ext/modules/version",
				"css/images/limitedCards",
			];
			for await (let i of folderFiles) {
				game.xjzh_removeFiles(i);
			}
		},
	},
	'3.03271': {
		changeLog: [
			"新增在线更新扩展，更新源默认为github，可能需要魔法",
			"为未安装十周年ui的玩家可能出现的技能特效弹窗再上一层保险",
			"修复华雄〖恃勇〗报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.03211': {
		changeLog: [
			"修复导出存档在没有存档的时候会报错",
			"修复未安装十周年UI可以开启技能特效导致的报错",
			"调整张春华〖伤逝〗，失去牌改成了使用牌，花色改为了颜色",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.03191': {
		changeLog: [
			"新增一个兑换码“diablo3，使用时间为2024/03/19——2024/03/27，超出时间将无法再使用该兑换码",
			"现在使用控制台会导致本局内无法获得成就、奇术要件等相关内容（感谢僵尸王的提醒）",
			"清除存档现在会重置本扩展所有存档",
			"优化曹操〖代诏〗，当只有一个选项时无需再选择选项",
			"修复林嘉笙〖甘霖〗，会重复对自己使用【闪电】导致进入循环",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.03071': {
		changeLog: [
			"为防止一些修改lib.characterTitle的扩展导致成就无法完成，调整了成就的初始化方式",
			"现在可以直接长按（pc端右击武将）快速查看当前武将成就是否完成",
			"移除大熊小猫成就“妻妾成群”",
			"调整成就解锁武将的方式",
			"调整大熊小猫〖奇策〗，摸牌不再立即使用",
			"调整大熊小猫〖天书〗，修改写入天书的武将牌的时机",
			"调整昔日烈火〖机变〗，适配新函数",
			"修复文鸯〖勇决〗，可能会对没有牌的角色使用【火攻】",
			"修复成就被错误重置的bug",
			"修复导出存档、清除存档点击报错",
			"修复林默〖默语〗，在ai使用该技能时报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.02281': {
		changeLog: [
			"调整增益技能〖梦蝶〗，使用新函数changeSkills",
			"调整林默〖真纹〗，使用新函数changeSkills",
			"调整林默〖默语〗，使用新函数changeSkills",
			"调整神吕布〖修罗〗，使用新函数changeSkills",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.02131': {
		changeLog: [
			"新增挑战boss武将冰霜巨兽",
			"修复小乔〖天香〗，不选择角色报错",
			"修复小乔〖天香〗，部分情况♠️视为♥️报错",
			"修复小乔〖额眉〗报错",
			"修复大乔〖婉容〗，不选择角色报错",
			"调整【知识竞赛】，增加多选题",
			"调整成就“完美斗士”、“火焰大师”、“莉莉丝的梦魇”、“刽子手”完成成就数量为60",
			"修复东方曜〖归尘〗，未触发〖星辰〗发动该技能报错",
			"调整小乔〖天香〗，♥️牌进入弃牌堆后改为即将进入弃牌堆时(处理区也会触发技能)",
			"调整大乔〖国色〗，技能触发时机改为准备阶段",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_daqiao", "xjzh_sanguo_xiaoqiao", "xjzh_boss_bingchuanjushou"],
		cards: [],
	},
	'3.02093': {
		changeLog: [
			"修复增益技能〖转魄〗，发动后未被禁用",
			"修复小乔〖额眉〗报错",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_daqiao", "xjzh_sanguo_xiaoqiao"],
		cards: [],
	},
	'3.02091': {
		changeLog: [
			"新增武将大乔",
			"新增武将小乔",
			"移除武将大小乔",
			"调整郭嘉〖鬼谋〗，摸牌阶段不再交换牌堆顶和牌堆底的牌",
			"调整郭嘉〖天启〗，发动技能不再禁用〖鬼谋〗",
			"调整增益技能〖转魄〗，不再提供自由选将和更换武将",
			"调整get.playerName()写法，如有报错请反馈",
			"调整增益技能，左幽不再因全局设置获得增益技能",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_daqiao", "xjzh_sanguo_xiaoqiao"],
		cards: [],
	},
	'3.02041': {
		changeLog: [
			"更新李白皮肤为[玉鸾吟]",
			"更新东方曜皮肤为[云鹰飞将]",
			"新增增益技能〖转魄〗",
			"修复增益技能〖瞬影〗，回合内其他角色未获得〖封印〗",
			"修复增益技能〖劫火〗，技能发动无效",
			"调整东方曜〖星辰〗，“强化裂空”改为使用一张【万箭齐发】",
			"调整东方曜〖裂空〗，具体效果看技能介绍",
			"调整增益技能〖炼狱〗，回合结束时你不再失去体力",
			"调整赵云〖绝境〗，移除了手牌上限锁定为4",
			"调整文鸯〖勇决〗，使用牌增加一个询问阶段",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_wzry_libai", "xjzh_wzry_yao"],
		cards: [],
	},
	'3.01271': {
		changeLog: [
			"适配无名杀1.10.6版本，本次更新必须更新此版本及以上",
			"将contains替换为includes（未测试），有bug请反馈",
			"因没有时间制作露头，为减小扩展包体积，故移除露头皮肤素材",
			"移除“炉火纯青”等四个相关成就",
			"移除部分武将的皮肤和皮肤语音",
			"移除负面增益技能",
			"移除随机武将",
			"修复公孙瓒〖白马〗报错",
			"修复林子言〖雷法〗报错",
			"修复管辂〖卜算〗可以选择相同类型的牌获得",
			"修复孙皓〖明政〗受到伤害后不会获得〖暴政〗",
			"修复曹操〖霸图〗在不是主公的情况下也可以发动",
			"调整陆逊〖焚营〗，移除标记数量改为至低为6",
			"调整陆逊〖焚营〗，火焰伤害改为目标红色手牌数量",
			"调整林子言〖雷法〗，受到伤害和成为【雷杀】不再发动该技能",
			"调整林子言〖天心〗，发动此技能不再禁用〖雷法〗",
			"调整张春华〖伤逝〗，移除forced标签改为frequent",
			"调整典韦〖铁躯〗，移除濒死回血",
			"调整典韦〖铁躯〗，选择一种类型的牌改为随机展示手牌中有的一种类型",
			"调整黄月英〖奇才〗，使用【顺手牵羊】不再观看目标的牌",
			"调整黄月英〖奇才〗，因该技能获得的牌不计入手牌上限",
			"调整黄月英〖机巧〗，移除次数限制",
			"调整黄月英〖鉴情〗，将该技能改为限定技",
			"调整蔡琰〖才情〗，出牌阶段结束时不再弃置所选花色的牌",
			"调整蔡琰〖才情〗，结束阶段不再选择其他角色失去技能",
			"调整蔡琰〖知书〗，移除额外手牌上限",
			"调整蔡琰〖悲歌〗，不再获得造成伤害的牌",
			"调整张春华〖伤逝〗，将额外摸牌改为弃置其他角色的牌",
			"调整esp孙策〖兴吴〗，获得技能直到回合结束改为下一次获得技能",
			"调整sp诸葛亮〖星魂〗技能库，不会再获得挑战武将的技能及隐藏/禁用武将的技能",
			"调整对局结束材料获取数量，每种至多1个",
			"调整对局结束材料获取概率，降低3倍",
			"调整昔日烈火〖机变〗，改进代码以不影响有“获得技能”的武将技能",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'3.01091': {
		changeLog: [
			"重做孙皓",
			"新增部分技能骨骼特效，需安装十周年UI扩展，请点击“安装扩展素材”复制素材",
			"新增武将朵莉亚",
			"修复对局结束不获得材料",
			"修复对局结束不获得奇术要件",
			"修复决斗者〖死斗〗报错",
			"修复黄月英〖机巧〗每回合限制次数失效",
			"修复esp刘协〖天命〗每回合限制次数失效",
			"调整【练气丹】，移除每局限两次",
			"调整【练气丹】，牌堆仅一张",
			"调整奇术要件默认关闭",
			"调整【谐角之冠】，现在失去技能也会触发谐角之冠",
			"调整奇术要件每日一次免费精魄获取，移除该功能",
			"调整林嘉笙〖妙法〗技能时机为你的准备阶段开始时",
			"调整王者BB机，移除开关并移除所有相关语音",
			"调整一键禁将，移除开关并移除相关代码",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_boss_datianshi", "xjzh_boss_xiaotianshi", "xjzh_boss_gaotianshi", "xjzh_boss_tianshizhang", "xjzh_wzry_duoliya", "xjzh_sanguo_sunhao"],
		cards: [],
	},
	'2.12201': {
		changeLog: [
			"新增一个极略三国武将“赵嫣”",
			"新增boss武将齐尔",
			"新增boss武将冰川巨兽",
			"新增boss武将督瑞尔",
			"新增boss武将格里高利",
			"新增一个挑战模式试炼关卡“天堂试炼”，目前还未做完",
			"新增“奇术要件”功能，可由成就进入查看，UI还未完全完成，感谢《时空枢纽》的作者鸽尔赞",
			"新增“奇术要件”等级机制，对局每级额外获得5%碎片，最高100级",
			"“奇术要件”会自动保存存档至本地，新存档会覆盖旧存档",
			"导出存档可以导出“奇术要件”存档",
			"导入存档可以导入“奇术要件”存档",
			"移除“武将加强”选项",
			"移除boss武将“吃朵棉花糖”",
			"移除一些冗余代码以提高流畅性（可能）",
			"移除nogainSkill,noremoveSkill,nodisableSkill",
			"修复管辂〖卜算〗衍生卡牌不显示素材",
			"修复管辂〖卜算〗无法使用【春风化雨】",
			"修复【知识竞赛】报错",
			"修复孙权〖吴战〗错误",
			"修复司马懿〖鹰视〗报错",
			"修复余木人〖拾樵〗报错",
			"修复莫轻言〖藏剑〗报错",
			"修复许诸〖虎痴〗报错",
			"修复宇智波止水〖瞬身〗获得牌错误",
			"修复索德罗斯衍生武器【观世正宗】及【巨力黄金锤】在无卡牌造成伤害时报错",
			"重做挑战boss瓦尔申",
			"在挑战模式且boss为瓦尔申、莉莉丝、都瑞尔、格里高利、冰中巨兽、齐尔时禁用增益技能，武将左幽不受影响",
			"调整【摧脉丹】ai已适配6个boss",
			"调整【谐角之冠】，现在对所有含usable标签的技能生效，但次数改为+2",
			"调整【谐角之冠】，现在会对新获得的技能生效",
			"调整“奇术要件”抽奖道具“精魄”兑换花费为75个碎片",
			"调整“奇术要件”抽奖道具“精魄”，每日获得一个“精魄”，时间为本次更新后首次开始游戏时间",
			"调整boss掉落表，部分4级奇术要件可由指定boss掉落",
			"调整亚菲克拉的衍生装备为奇术要件，同时调整对应技能",
			"调整胜利后碎片获取数量，不再以随机倍数乘2，改为1、1.25、1.5随机倍数",
			"调整非挑战模式武将莉莉丝，移除技能〖憎恨〗",
			"调整莉莉丝〖强击〗，受到伤害后使用的牌改为对其造成伤害的牌，并可以获得牌堆顶x张牌",
			"调整changexjzhBUFF,可以通过参数无视buff上限获得buff",
			"调整buff<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_buff_zhongdu');\">中毒</a>",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_jlsg_zhaoyan", "xjzh_boss_bingchuanjushou", "xjzh_boss_ttshilian", "xjzh_boss_qier", "xjzh_boss_geligaoli", "xjzh_boss_duruier", "xjzh_boss_waershen", "xjzh_boss_lilisi"],
		cards: [],
	},
	'2.10161': {
		changeLog: [
			"<b><font color=\"#FFA500\" size=\"15\">移除仙武同人·王者荣耀包宫本武藏，因该武将为周六设计，且此人乱开地图炮无中生有</font></b>",
			"修复成就列表过滤器无法隐蔽已完成成就",
			"修复增益技能〖倒戈〗变换身份后满足胜利条件游戏不结束",
			"修复增益技能〖重塑〗失去该技能不会清除已保存的数据",
			"修复左幽〖通玄〗，在游戏开始后获得技能〖重塑〗无法正确触发该技能",
			"修复管辂〖卜算〗衍生卡牌不显示素材",
			"修复get.xjzh_rands()会返回不存在某一元素的数组",
			"修复【知识竞赛】报错",
			"优化esp孙策〖激昂〗ai",
			"移除扩展菜单界面的QQ群二维码，在声明中保留QQ群号",
			"重新添加“安装扩展素材”按钮，因偶然发现魔改十周年不支持原版十周年的卡牌美化代码",
			"现在“安装扩展素材”会自动识别你所使用的UI并安装到对应位置",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.10081': {
		changeLog: [
			"新增增益技能<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_zengyi_daoge');\">〖倒戈〗</a>",
			"新增“卡牌美化”开关，需十周年UI支持，开启后无需复制素材即可显示本扩展卡牌美化素材",
			"新增自动备份成就存档，每次载入游戏时都会自动备份成就存档",
			"移除完成成就的模式限制，现在会根据不同的成就限制完成的模式",
			"修复黄月英〖奇才〗，成为延时锦囊牌也可以触发技能",
			"修复增益技能〖重塑〗偶尔无限循环的bug",
			"修复因上一版本添加成就导致的仙武同人包错误的bug",
			"优化esp孙策〖激昂〗",
			"优化左幽〖通玄〗",
			"调整卡牌<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_card_yizhihuhuan');\">【意志呼唤】</a>",
			"调整卡牌显示条件，无需本扩展卡牌素材复制至十周年UI即可显示所有本扩展十周年UI卡牌素材，其他UI需手动复制",
			"优化所有卡牌素材，在未安装UI扩展的情况下显示效果更好",
			"优化增益技能〖重塑〗，现在可以明确看到将某一个阶段改为了哪一个阶段",
			"调整所有nature相关函数至最新版本体函数",
			"调整管辂〖卜算〗衍生牌素材",
			"调整sp诸葛亮〖观星〗，结束阶段发动技能观看牌堆顶3张牌",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: ["xjzh_card_yizhihuhuan"],
	},
	'2.10051': {
		changeLog: [
			"新增增益技能<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_zengyi_chongsu');\">〖重塑〗</a>",
			"更新【知识竞赛】题库",
			"修复nogainSkill报错",
			"修复sp诸葛亮〖观星〗报错",
			"移除部分无用素材",
			"移除“国战补充”，本扩展武将不在国战模式开启“仅国战武将”时使用",
			"移除“安装扩展素材”和“切换卡牌素材”，在安装“十周年UI”的情况下无需素材复制，其他UI可手动复制",
			"调整sp诸葛亮体力上限为3点",
			"调整sp诸葛亮〖星殒〗，改为技能<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_sanguo_qixing');\">七星</a>",
			"调整sp诸葛亮〖观星〗，由锁定技改为非锁定技",
			"调整sp诸葛亮〖观星〗，触发时机改为你的准备阶段和你的结束阶段",
			"调整sp诸葛亮〖观星〗，准备/结束阶段观看的牌分别为5和场上存活的角色数量",
			"调整sp诸葛亮〖观星〗，改为场上其他角色手牌对你可见",
			"修复增益技能〖瞬影〗，玩家为主公时无限循环",
			"修复左幽〖通玄〗无法获得技能〖重塑〗",
			"修复因十周年UI获得技能不显示或失去技能依然显示",
			"调整莉莉丝〖强击〗，离开游戏后返回游戏时会开始一个额外的回合",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.10021': {
		changeLog: [
			"新增武将极略sp神貂蝉，极略更新后移除",
			"新增大量武将成就，这部分成就只能在玩家为单将的情况下完成",
			"重新上线张春华",
			"修复孙悟空〖洞察〗弹窗",
			"修复removeSkill函数因原版十周年弹窗",
			"修复李白〖侠行〗选择目标数量错误",
			"同步部分函数至最新版本体函数",
			"调整关羽〖武圣〗，因该技能使用或打出的【杀】视为红色杀",
			"调整决斗者〖剑风〗，移除剑风第二次使用【杀】伤害免疫",
			"调整characterTitle列表为武将称号",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_chunhua", "xjzh_jlsg_diaochan"],
		cards: [],
	},
	'2.09251': {
		changeLog: [
			"重写备份恢复代码，正确恢复拉斯玛及成就存档",
			"现在拉斯玛的“导入存档”选项也可以用来恢复成就存档",
			"现在拉斯玛的“导出存档”选项也会导出一份成就存档",
			"现在拉斯玛的“清除存档”选项也会清除成就存档",
			"因每次备份本地存档均会覆盖原文件，请自行拷贝重要存档至其他文件夹",
			"移除成就存档副本，保留自动本地存档备份",
			"将成就本地存档内容转为神秘字符",
			"将死灵之书本地存档内容转为神秘字符",
			"恢复因上一版本更新被注释的成就完成防作弊",
			"为防止导入存档时选择文件不小心点错导致导入失败或卡死做了以下措施↓",
			"存档备份文档格式修改为json格式",
			"导入非json格式的文件会停止运行代码",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09241': {
		changeLog: [
			"移除武将张春华",
			"考虑到有玩家反馈成就丢失，添加了以下措施↓",
			"新增成就存档副本，每次成就进度更新都会创建一个副本成就存档",
			"新增成就存档备份，每次成就进度更新都会自动备份存档至本地",
			"新增成就存档覆盖，每次本扩展更新后都会自动覆盖本地存档",
			"新增removeAchi()，用于重置某一个成就",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09231': {
		changeLog: [
			"新增武将姜凝脂",
			"新增武将文鸯",
			"移除changeDamage函数",
			"为damage()添加counting参数，用于将伤害点数改为1且重复触发",
			"为damage()添加untriggering参数，用于不触发damage时机",
			"移除洗牌函数，使用本体函数",
			"修复宫本武藏〖二天〗弹窗",
			"修复$logSkill导致的v1.10.1.0.1版本when()函数弹窗",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_zxzh_jiangningzhi", "xjzh_sanguo_wenyang"],
		cards: [],
	},
	'2.09171': {
		changeLog: [
			"新增esp刘协成就“再兴炎汉”",
			"新增成就获得的一些条件，如：使用控制台后无法获得成就，武将不为仙家之魂武将无法获得成就，游戏模式不为身份模式无法获得成就",
			"调整东方曜〖裂空〗及<a style='color:#FFFF00' href=\"javascript:game.xjzh_openDialog('xjzh_wzry_liekong3');\">强化裂空</a>，具体内容看技能介绍",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_wzry_yao"],
		cards: [],
	},
	'2.09122': {
		changeLog: [
			"新增get.xjzh_device，用于判断当前设备类型",
			"新增get.xjzh_kernel()，用于判断当前设备浏览器内核",
			"调整亚菲克拉，在非安卓设备或非webKit内核上禁用该武将",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09121': {
		changeLog: [
			"调整esp孙策〖魂资〗，现在受到伤害也可以摸一张牌",
			"调整esp孙策〖魂资〗，同一张牌现在只能令你摸一张牌",
			"调整esp孙策〖魂资〗，移除卡牌花色视为无花色",
			"调整esp孙策〖激昂〗，将你们的发动时机改为指定/成为目标后",
			"调整esp孙策〖激昂〗，现在使用指定全部目标的[伤害]卡牌只会询问第一个目标",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09053': {
		changeLog: [
			"修复esp孙策〖诈亡〗可以无限制发动",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09052': {
		changeLog: [
			"修复esp孙策〖兴吴〗可以获得非吴势力武将技能",
			"修复许多bug",
			"优化许多细节",
		],
		players: [],
		cards: [],
	},
	'2.09051': {
		changeLog: [
			"重做曹操",
			"新增武将esp孙策",
			"新增removeSkillLog和addTempSkillLog，以简化每次获得或失去技能时都需要写game.log",
			"修复【驽马】能选择已废除+1马栏的角色",
			"修复司马懿〖奇才〗报错",
			"修复公孙瓒〖募马〗，复制的牌也会被洗入牌堆，但仍会计算马的数量以防止伤害",
			"修复公孙瓒〖白马〗技能描述中“新的回合”为“额外的回合”",
			"调整公孙瓒〖募马〗，改为受到伤害时若弃牌堆的马大于牌堆的马则防止此伤害",
			"调整蔡琰〖归汉〗描述，将“〖悲歌〗将第一名其他角色”改为“移除技能〖悲歌〗并可以令一名其他角色获得该技能”",
			"调整蔡琰〖归汉〗，由觉醒技改为限定技",
			"调整赵云〖佩剑〗，移除装备其他角色的【青釭剑】效果",
			"调整甘宁〖游侠〗，因〖游侠〗获得的牌不会再显示“游侠”tag",
			"调整童渊/界童渊〖克乱〗，不使用【杀】不再摸牌",
			"调整卡夏〖箭雨〗，改为每两轮一次使用一张【万箭齐发】",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_caocao", "xjzh_sanguo_espsunce"],
		cards: [],
	},
	'2.08281': {
		changeLog: [
			"重做张辽",
			"下线poe模式，等待进一步完善",
			"移除“在线更新”，维护太麻烦了",
			"新增“恶念之心”开关，关闭后所有模式都不再获得恶念之心且不再提示选择恶念之心技能",
			"由于露头皮肤不全，暂时隐藏并关闭露头选项",
			"移除“禁止平局”功能",
			"修复暗黑破坏神分包部分有蓝条的武将弹窗",
			"修复关羽〖武神〗弹窗",
			"修复孙权〖制衡〗摸牌数量不正确",
			"修复孙皓〖暴政〗全场有标记时不触发伤害和摸牌",
			"修复管辂〖卜算〗无法使用衍生牌",
			"修复甘宁〖游侠〗描述",
			"修复于吉在所有模式被禁用",
			"修复袁绍〖名门〗全部猜错时报错",
			"修复袁绍〖贪智〗全部猜对时报错",
			"修复陆逊〖火令〗发动技能会弃置所有牌",
			"修复陆逊〖火令〗造成伤害也会获得“书”",
			"修复庞统〖谋略〗不弃牌",
			"修复南华老仙〖授业〗最后一个位置的武将未获得技能",
			"修复南华老仙〖授业〗，其他武将发动获得的技能或南华老仙回合开始时其他角色未失去技能",
			"修复南华老仙〖仙授〗，其他角色发动因〖授业〗获得的技能时无法获得其技能",
			"修复南华老仙〖仙授〗，南华老仙发动因〖仙授〗获得的技能后未失去该技能",
			"修复南华老仙〖论道〗弹窗报错",
			"修复南华老仙〖论道〗论道胜利后该角色可以对南华老仙用牌",
			"修复sp华佗〖青囊〗不触发技能",
			"修复莉莉丝〖连击〗对装备牌也生效",
			"优化袁绍〖名门〗，加了一些提示，再也不用担心猜不对了",
			"调整【知识竞赛】，现在不会在同一次答题中出现相同的题目",
			"调整角色页面的武将视频使用本地文件",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_sanguo_zhangliao"],
		cards: [],
	},
	'2.08161': {
		changeLog: [
			"重新上线POE模式(尚未完成)，可在扩展页面打开或关闭",
			"隐藏第一项扩展介绍",
			"新增武将娜塔亚",
			"新增恶念之心【疾疫刀尖】",
			"新增恶念之心【复仇之笼】",
			"补全袁绍，快来“猜”吧",
			"调整瓦尔申〖恶毒〗ai",
			"调整瓦尔申〖阴险〗ai，瓦尔申一血时其他角色不会使用酒杀",
			"调整部分技能和卡牌描述中的〖〗和【】，遵照三国杀规则集",
			"调整所有恶念之心，不会再被“封印”等技能导致失效",
			"调整卫士〖斗士〗，适配新函数",
			"修复华雄〖耀武〗，目标未获得体力上限",
			"修复第一次挑战瓦尔申成功后报错",
			"修复sp张角〖太平〗弹窗",
			"移除专属技能选项及素材",
			"移除历史更新记录(主要是历史记录中的〖〗和【】不想改了)",
			"修复许多bug",
			"优化许多细节",
		],
		players: ["xjzh_diablo_nataya", "xjzh_sanguo_yuanshao"],
		cards: [],
	},
};
