const characterIntro = {
	"xjzh_boss_lilisi":"莉莉丝是游戏《暗黑破坏神Ⅱ》及《暗黑破坏神IV》中的角色，是憎恨之王墨菲斯托的女儿、庇护所的创造者。<br><br>消耗所有材料各2个可以挑战该boss，胜利时奖励至少1个精魄，额外获得2倍于本局碎片数量个碎片，有几率获得1-4级奇术要件1个，必定获得随机5级奇术要件1个。",
	"xjzh_boss_waershen":"瓦尔申《暗黑破坏神IV》中的角色。<br><br>消耗恶念之心、颤栗之手、发黑的股骨、咕噜头颅各2个可以挑战该boss，胜利时奖励2个活体钢铁、1个粘液覆盖的蛋，额外获得3个碎片。",
	"xjzh_boss_zuoyou":"据说是左慈的女儿/徒弟，但无从查据",
	"xjzh_boss_lvbu":"字奉先，并州五原郡九原县人。东汉末年名将、东汉末年群雄之一。",
	"xjzh_boss_zhangjiao":"（？－184年），钜鹿（秦治今河北平乡、东汉治今河北宁晋）人。中国东汉末年农民起义军“黄巾军”的领袖。",
	"xjzh_boss_geligaoli":"消耗5个活体钢铁可以挑战该boss，胜利时奖励1个苦痛碎片，额外获得5个碎片。",
	"xjzh_boss_duruier":"督瑞尔是游戏《暗黑破坏神Ⅱ》及《暗黑破坏神IV》中的角色，次级恶魔之一，也称痛苦之王，与所有的大恶魔一样，督瑞尔是从塔萨米特的七个头颅之一中生成的，他统治着地狱的痛苦领域。<br><br>消耗5个活体钢铁可以挑战该boss，胜利时奖励2个提纯的恐惧、2个提纯的鲜血，额外获得7个碎片。",
	"xjzh_boss_qier":"消耗9个提纯的鲜血可以挑战该boss，胜利时奖励3个提纯的恐惧，额外获得10个碎片。",
	"xjzh_boss_bingchuanjushou":"消耗9个提纯的恐惧可以挑战该boss，胜利时奖励3个提纯的鲜血，额外获得10个碎片。",
	"xjzh_boss_ttshilian":"消耗一个“世界之石碎片”参加一场高阶天堂试炼挑战，该挑战分为以下几个阶段<br><br><li>第一阶段：挑战1个大天使和2小天使<br><br><li>第二阶段：挑战1个高阶天使和2个大天使<br><br><li>第三阶段：挑战1个天使长和2个高阶天使<br><br><li>第四阶段：<br><br>早上8点-12点，晚上20点-24点挑战boss“伊纳瑞斯”和2个天使长<br><br>下午12点-16点，晚上0点-4点挑战boss“马萨伊尔”和1个夺魂者、1个堕落天使<br><br>除以上时间外挑战boss“塔尔拉沙”和2个剧毒沙虫",

};

export default characterIntro;